startCategory(cfin).
[dy] :: ([c1, -a, -d]).
[] :: ([=c3, cfin]).
[një] :: ([c1, -b, -d]).
[tre] :: ([c1, -b]).
[katër] :: ([c1, -b]).
[pesë] :: ([c1, -b, -e]).
[gjashtë] :: ([c1, -b, -e]).
[shtatë] :: ([c1, -b, -e]).
[tetë] :: ([c1, -b, -e]).
[nëntë] :: ([c1, -b, -e]).
[qind] :: ([=cnix, =c1, c3]).
[] :: ([cnix]).
[qind_e] :: ([=c3f, =c1, c3]).
[] :: ([=c2, +f, c3f]).
[] :: ([=c2, +s0, c3]).
[dhjetë] :: ([c2, -s0, -f]).
[mbëdhjete] :: ([=c1, +a, c2, -s0]).
[mbëdhjetë] :: ([=c1, +b, c2, -s0]).
[tridhjetë] :: ([c2, -s0, -f]).
[tridhjetë_e] :: ([=c1, c2, -s0]).
[zet] :: ([=c1, +d, c2, -s0]).
[zet_e] :: ([=c1, =c2d, c2, -s0]).
[] :: ([=c1, +d, c2d]).
[dhjetë] :: ([=c1, +e, c2, -s0]).
[dhjetë_e] :: ([=c1, =c2e, c2, -s0]).
[] :: ([=c1, +e, c2e]).
[] :: ([=c1, c3]).
[] :: ([=c1, c2, -f]).
[] :: ([=c1, +d, c1]).
[] :: ([=c2, +f, c2]).
[] :: ([=c1, +b, c1]).
[] :: ([=c1, +e, c1]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c1, +a, c1]).
[] :: ([=c1, +a, +d, c1, -a]).
[] :: ([=c1, +b, +e, c1, -b]).
[] :: ([=c2, +s0, +f, c2, -s0]).
[] :: ([=c1, +b, +d, c1, -b]).
