startCategory(cfin).
[واحد] :: ([c1, -e, -i0]).
[سبعة] :: ([c1, -g, -a, -h0]).
[] :: ([=c4, cfin]).
[اثنان] :: ([c1, -f0]).
[ثلاثة] :: ([c1, -a]).
[أربعة] :: ([c1, -a]).
[خمسة] :: ([c1, -a]).
[ستة] :: ([c1, -a, -f0, -k0]).
[ثمانية] :: ([c1, -a]).
[تسعة] :: ([c1, -a]).
[عشرة] :: ([c2, -c, -s1, -h]).
[أحد_عشر] :: ([c2, -c, -s1]).
[اثنا_عشر] :: ([c2, -c, -s1]).
[] :: ([=c1, c2, -c]).
[ثلاثمائة] :: ([c4]).
[ثلاثمائة_و] :: ([=c3c, c4]).
[] :: ([=c2, +c, c4c]).
[ثلاثمائة] :: ([=c3d, c4]).
[] :: ([=c2, +d, c4d]).
[أربعمائة] :: ([c4]).
[أربعمائة_و] :: ([=c3c, c4]).
[أربعمائة] :: ([=c3d, c4]).
[خمسمائة] :: ([c4]).
[خمسمائة_و] :: ([=c3c, c4]).
[خمسمائة] :: ([=c3d, c4]).
[ستمائة] :: ([c4]).
[ستمائة_و] :: ([=c3c, c4]).
[ستمائة] :: ([=c3d, c4]).
[سبعمائة] :: ([c4]).
[سبعمائة_و] :: ([=c3c, c4]).
[سبعمائة] :: ([=c3d, c4]).
[ثمانمائة] :: ([c4]).
[ثمانمائة_و] :: ([=c3c, c4]).
[ثمانمائة] :: ([=c3d, c4]).
[تسعمائة] :: ([c4]).
[تسعمائة_و] :: ([=c3c, c4]).
[تسعمائة] :: ([=c3d, c4]).
[ألف__و] :: ([=c4f, =c4e, c4]).
[] :: ([=c1, +e, c4e]).
[] :: ([=c3, +f, c4f]).
[آلاف__و] :: ([=c4f, =c4g, c4]).
[] :: ([=c1, +g, c4g]).
[آلاف] :: ([=c2, +h, c4]).
[ألف] :: ([=c2, +i, c4]).
[J_ألفاً__و] :: ([=c4k, c4]).
[] :: ([=c3, +k, c4k]).
[] :: ([=c3, +s0, c4]).
[مائة] :: ([c3, -s0, -f]).
[مائة_و] :: ([=c3c, c3, -s0]).
[] :: ([=c2, +c, c3c]).
[مائة] :: ([=c3d, c3, -s0]).
[] :: ([=c2, +d, c3d]).
[مئتا] :: ([c3, -s0, -f, -k]).
[مئتان_و] :: ([=c3c, c3, -s0]).
[مئتان] :: ([=c3d, c3, -s0]).
[] :: ([=c2, +s1, c4]).
[عشر] :: ([=c1, +a, c2, -s1]).
[عشرون] :: ([c2, -s1, -d, -i]).
[و_عشرون] :: ([=cnix, =c1, c2, -s1]).
[] :: ([cnix]).
[ثلاثون] :: ([c2, -s1, -d]).
[و_ثلاثون] :: ([=cnix, =c1, c2, -s1]).
[أربعون] :: ([c2, -s1, -d]).
[و_أربعون] :: ([=cnix, =c1, c2, -s1]).
[خمسون] :: ([c2, -s1, -d]).
[و_خمسون] :: ([=cnix, =c1, c2, -s1]).
[ستون] :: ([c2, -s1, -d]).
[و_ستون] :: ([=cnix, =c1, c2, -s1]).
[سبعون] :: ([c2, -s1, -d]).
[و_سبعون] :: ([=cnix, =c1, c2, -s1]).
[ثمانون] :: ([c2, -s1, -d]).
[و_ثمانون] :: ([=cnix, =c1, c2, -s1]).
[تسعون] :: ([c2, -s1, -d]).
[و_تسعون] :: ([=cnix, =c1, c2, -s1]).
[] :: ([=c1, c4]).
[] :: ([=c1, +f0, c3, -f]).
[] :: ([=c1, +i0, c2, -i]).
[] :: ([=c1, +h0, c2, -h]).
[] :: ([=c1, +k0, c3, -k]).
[] :: ([=c1, +i0, c1]).
[] :: ([=c2, +c, c2]).
[] :: ([=c1, +e, c1]).
[] :: ([=c2, +h, c2]).
[] :: ([=c1, +k0, c1]).
[] :: ([=c1, +g, c1]).
[] :: ([=c2, +d, c2]).
[] :: ([=c2, +i, c2]).
[] :: ([=c3, +k, c3]).
[] :: ([=c1, +a, c1]).
[] :: ([=c1, +h0, c1]).
[] :: ([=c2, +s1, c2]).
[] :: ([=c3, +f, c3]).
[] :: ([=c3, +s0, c3]).
[] :: ([=c1, +f0, c1]).
[] :: ([=c1, +f0, +k0, c1, -f0]).
[] :: ([=c3, +f, +k, c3, -f]).
[] :: ([=c2, +s1, +d, +i, c2, -s1]).
[] :: ([=c3, +s0, +f, c3, -s0]).
[] :: ([=c2, +s1, +d, c2, -s1]).
[] :: ([=c1, +g, +a, +h0, c1, -g]).
[] :: ([=c3, +s0, +f, +k, c3, -s0]).
[] :: ([=c2, +c, +s1, c2, -c]).
[] :: ([=c2, +s1, +h, c2, -s1]).
[] :: ([=c1, +a, +h0, c1, -a]).
[] :: ([=c1, +e, +i0, c1, -e]).
[] :: ([=c2, +d, +i, c2, -d]).
[] :: ([=c1, +a, +f0, +k0, c1, -a]).
[] :: ([=c2, +c, +s1, +h, c2, -c]).
