startCategory(cfin).
[] :: ([=c3, cfin]).
[տաս] :: ([c2, -b, -s0]).
[քսան] :: ([c2, -b, -s0]).
[երեսուն] :: ([c2, -b, -s0]).
[քառասուն] :: ([c2, -b, -s0]).
[հիսուն] :: ([c2, -b, -s0]).
[վաթսուն] :: ([c2, -b, -s0]).
[յոթանասուն] :: ([c2, -b, -s0]).
[ութսուն] :: ([c2, -b, -s0]).
[իննսուն] :: ([c2, -b, -s0]).
[] :: ([=c1, +b0, c2, -b]).
[մեկ] :: ([c1, -b0, -a]).
[երկու] :: ([c1, -b0, -c, -a]).
[չորս] :: ([c1, -b0, -c, -a]).
[հինգ] :: ([c1, -b0, -c, -a]).
[ինը] :: ([c1, -b0, -c, -a]).
[հարյուր] :: ([c3]).
[հարյուր] :: ([=c3b, c3]).
[] :: ([=c2, +b, c3b]).
[երեք_հարյուր] :: ([c3]).
[երեք_հարյուր] :: ([=c3b, c3]).
[հարյուր] :: ([=c1, +c, c3]).
[հարյուր] :: ([=c3b, =c3c, c3]).
[] :: ([=c1, +c, c3c]).
[վեց_հարյուր] :: ([c3]).
[վեց_հարյուր] :: ([=c3b, c3]).
[յոթ_հարյուր] :: ([c3]).
[յոթ_հարյուր] :: ([=c3b, c3]).
[ութ_հարյուր] :: ([c3]).
[ութ_հարյուր] :: ([=c3b, c3]).
[] :: ([=c2, +s0, c3]).
[տասն] :: ([=c2a, c2, -s0]).
[] :: ([=c1, +a, c2a]).
[քսան] :: ([=c2a, c2, -s0]).
[երեսուն] :: ([=c2a, c2, -s0]).
[քառասուն] :: ([=c2a, c2, -s0]).
[հիսուն] :: ([=c2a, c2, -s0]).
[վաթսուն] :: ([=c2a, c2, -s0]).
[յոթանասուն] :: ([=c2a, c2, -s0]).
[ութսուն] :: ([=c2a, c2, -s0]).
[իննսուն] :: ([=c2a, c2, -s0]).
[] :: ([=c1, c3]).
[] :: ([c1]).
[] :: ([=c1, +c, c1]).
[] :: ([=c1, +b0, c1]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c1, +a, c1]).
[] :: ([=c2, +b, c2]).
[] :: ([=c1, +b0, +a, c1, -b0]).
[] :: ([=c2, +b, +s0, c2, -b]).
[] :: ([=c1, +c, +a, c1, -c]).
[] :: ([=c1, +b0, +c, +a, c1, -b0]).
