startCategory(cfin).
[] :: ([=c3, cfin]).
[он] :: ([c2, -b, -s0]).
[он_уч] :: ([c2, -b, -s0]).
[ијирми] :: ([c2, -b, -s0]).
[ијирми_уч] :: ([c2, -b, -s0]).
[отуз] :: ([c2, -b, -s0]).
[отуз_уч] :: ([c2, -b, -s0]).
[гырх] :: ([c2, -b, -s0]).
[гырх_уч] :: ([c2, -b, -s0]).
[әлли] :: ([c2, -b, -s0]).
[әлли_уч] :: ([c2, -b, -s0]).
[алтмыш] :: ([c2, -b, -s0]).
[алтмыш_уч] :: ([c2, -b, -s0]).
[јетмиш] :: ([c2, -b, -s0]).
[јетмиш_уч] :: ([c2, -b, -s0]).
[сәксән] :: ([c2, -b, -s0]).
[сәксән_уч] :: ([c2, -b, -s0]).
[дохсан] :: ([c2, -b, -s0]).
[дохсан_уч] :: ([c2, -b, -s0]).
[] :: ([=c1, +b0, c2, -b]).
[бир] :: ([c1, -b0, -a]).
[ики] :: ([c1, -b0, -c, -a]).
[дөрд] :: ([c1, -b0, -c, -a]).
[беш] :: ([c1, -b0, -c, -a]).
[алты] :: ([c1, -b0, -c, -a]).
[једди] :: ([c1, -b0, -c, -a]).
[сәккиз] :: ([c1, -b0, -c, -a]).
[доггуз] :: ([c1, -b0, -c, -a]).
[үч] :: ([c1, -c]).
[јүз] :: ([c3]).
[јүз] :: ([=c3b, c3]).
[] :: ([=c2, +b, c3b]).
[јүз_уч] :: ([c3]).
[јүз] :: ([=c1, +c, c3]).
[јүз] :: ([=c3b, =c3c, c3]).
[] :: ([=c1, +c, c3c]).
[јүз_уч] :: ([=c1, +c, c3]).
[] :: ([=c2, +s0, c3]).
[он] :: ([=c2a, c2, -s0]).
[] :: ([=c1, +a, c2a]).
[ијирми] :: ([=c2a, c2, -s0]).
[отуз] :: ([=c2a, c2, -s0]).
[гырх] :: ([=c2a, c2, -s0]).
[әлли] :: ([=c2a, c2, -s0]).
[алтмыш] :: ([=c2a, c2, -s0]).
[јетмиш] :: ([=c2a, c2, -s0]).
[сәксән] :: ([=c2a, c2, -s0]).
[дохсан] :: ([=c2a, c2, -s0]).
[] :: ([=c1, c3]).
[] :: ([=c1, +c, c1]).
[] :: ([=c1, +b0, c1]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c1, +a, c1]).
[] :: ([=c2, +b, c2]).
[] :: ([=c1, +b0, +a, c1, -b0]).
[] :: ([=c2, +b, +s0, c2, -b]).
[] :: ([=c1, +c, +a, c1, -c]).
[] :: ([=c1, +b0, +c, +a, c1, -b0]).
