startCategory(cfin).
[fila] :: ([c1, -c, -e]).
[] :: ([=c3, cfin]).
[sàba] :: ([c1, -b, -e]).
[dúuru] :: ([c1, -b, -e]).
[wɔɔrɔ] :: ([c1, -b, -e]).
[séegin] :: ([c1, -b, -f]).
[k̀ɔnɔntɔn] :: ([c1, -b, -f]).
[náani] :: ([c1, -e]).
[k̀ɛmɛ] :: ([c3]).
[k̀ɛmɛ_ní] :: ([=c3d, c3]).
[] :: ([=c2, +d, c3d]).
[k̀ɛmɛ] :: ([=c31se, c3]).
[] :: ([=c1, +e, c3e]).
[k̀ɛmɛ] :: ([=c31s, c3]).
[ní] :: ([=c3d, =c31se, c31s]).
[] :: ([=c1, +e, c31se]).
[] :: ([=c2, +d, c31sd]).
[k̀ɛmɛ] :: ([=c1, +f, c3]).
[k̀ɛmɛ_ní] :: ([=c3d, =c3f, c3]).
[] :: ([=c1, +f, c3f]).
[] :: ([=c2, +s0, c3]).
[tán] :: ([c2, -s0, -d]).
[tán_ní] :: ([=c1, c2, -s0]).
[mùgan] :: ([c2, -s0, -d]).
[mùgan_ní] :: ([=c1, c2, -s0]).
[bínaani] :: ([c2, -s0, -d]).
[bínaani_ní] :: ([=c1, c2, -s0]).
[bí] :: ([=c21sb, c2, -s0]).
[] :: ([=c1, +b, c2b]).
[bí] :: ([=c21s, c2, -s0]).
[ní] :: ([=c1, =c21sb, c21s]).
[] :: ([=c1, +b, c21sb]).
[bíwolon] :: ([=c22sc, c2, -s0]).
[] :: ([=c1, +c, c2c]).
[bíwolon] :: ([=c22s, c2, -s0]).
[ní] :: ([=c1, =c22sc, c22s]).
[] :: ([=c1, +c, c22sc]).
[] :: ([=c1, c3]).
[kélen] :: ([c1]).
[wólonwula] :: ([c1, -f]).
[] :: ([=c1, c2, -d]).
[] :: ([=c1, +b, c1]).
[] :: ([=c1, +e, c1]).
[] :: ([=c1, +c, c1]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c1, +f, c1]).
[] :: ([=c2, +d, c2]).
[] :: ([=c1, +c, +e, c1, -c]).
[] :: ([=c1, +b, +e, c1, -b]).
[] :: ([=c2, +s0, +d, c2, -s0]).
[] :: ([=c1, +b, +f, c1, -b]).
