startCategory(cfin).
[] :: ([=c3, cfin]).
[ун] :: ([c2, -b, -s0]).
[егерме] :: ([c2, -b, -s0]).
[утыҙ] :: ([c2, -b, -s0]).
[ҡырҡ] :: ([c2, -b, -s0]).
[илле] :: ([c2, -b, -s0]).
[алтмыш] :: ([c2, -b, -s0]).
[етмеш] :: ([c2, -b, -s0]).
[һикһән] :: ([c2, -b, -s0]).
[туҡһан] :: ([c2, -b, -s0]).
[] :: ([=c1, c2, -b]).
[бер] :: ([c1]).
[ике] :: ([c1, -c]).
[өс] :: ([c1, -c]).
[дүрт] :: ([c1, -c]).
[биш] :: ([c1, -c]).
[алты] :: ([c1, -c]).
[ете] :: ([c1, -c]).
[һигеҙ] :: ([c1, -c]).
[туғыҙ] :: ([c1, -c]).
[йөҙ] :: ([c3]).
[йөҙ] :: ([=c3b, c3]).
[] :: ([=c2, +b, c3b]).
[йөҙ] :: ([=c1, +c, c3]).
[йөҙ] :: ([=c3b, =c3c, c3]).
[] :: ([=c1, +c, c3c]).
[] :: ([=c2, +s0, c3]).
[ун] :: ([=c1, c2, -s0]).
[егерме] :: ([=c1, c2, -s0]).
[утыҙ] :: ([=c1, c2, -s0]).
[ҡырҡ] :: ([=c1, c2, -s0]).
[илле] :: ([=c1, c2, -s0]).
[алтмыш] :: ([=c1, c2, -s0]).
[етмеш] :: ([=c1, c2, -s0]).
[һикһән] :: ([=c1, c2, -s0]).
[туҡһан] :: ([=c1, c2, -s0]).
[] :: ([=c1, c3]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c2, +b, c2]).
[] :: ([=c1, +c, c1]).
[] :: ([=c2, +b, +s0, c2, -b]).
