startCategory(cfin).
[тры] :: ([c1, -f, -a]).
[чаты́ры] :: ([c1, -g]).
[пяць] :: ([c1, -c, -h]).
[сем] :: ([c1, -i, -h]).
[во́сем] :: ([c1, -d]).
[] :: ([=c3, cfin]).
[адзі́н] :: ([c1]).
[два] :: ([c1, -a]).
[шэсць] :: ([c1, -h]).
[дзе́вяць] :: ([c1]).
[дзе́сяць] :: ([c2, -e, -s0]).
[адзіна́ццаць] :: ([c2, -e, -s0]).
[чатырна́ццаць] :: ([c2, -e, -s0]).
[пятна́ццаць] :: ([c2, -e, -s0]).
[шасна́ццаць] :: ([c2, -e, -s0]).
[сямна́ццаць] :: ([c2, -e, -s0]).
[васямна́ццаць] :: ([c2, -e, -s0]).
[дзевятна́ццаць] :: ([c2, -e, -s0]).
[со́рак] :: ([c2, -e, -s0]).
[шэ́сцьдзесят] :: ([c2, -e, -s0]).
[се́мдзесят] :: ([c2, -e, -s0]).
[дзевяно́ста] :: ([c2, -e, -s0]).
[] :: ([=c1, c2, -e]).
[сто] :: ([c3]).
[сто] :: ([=c3e, c3]).
[] :: ([=c2, +e, c3e]).
[дзве́сце] :: ([c3]).
[дзве́сце] :: ([=c3e, c3]).
[́ста] :: ([=c1, +f, c3]).
[́ста] :: ([=c3e, =c3f, c3]).
[] :: ([=c1, +f, c3f]).
[ста] :: ([=c1, +g, c3]).
[ста] :: ([=c3e, =c3g, c3]).
[] :: ([=c1, +g, c3g]).
[со́т] :: ([=c1, +h, c3]).
[со́т] :: ([=c3e, =c3h, c3]).
[] :: ([=c1, +h, c3h]).
[во] :: ([=c31s, c3]).
[со́т] :: ([=c1, +i, c31s]).
[во] :: ([=c32s, c3]).
[со́т] :: ([=c3e, =c32si, c32s]).
[] :: ([=c1, +i, c32si]).
[] :: ([=c2, +e, c32se]).
[дзевяцьсо́т] :: ([c3]).
[дзевяцьсо́т] :: ([=c3e, c3]).
[] :: ([=c2, +s0, c3]).
[на́ццаць] :: ([=c1, +a, c2, -s0]).
[́ццаць] :: ([=c1, +a, c2, -s0]).
[́ццаць] :: ([=c1, =c2a, c2, -s0]).
[] :: ([=c1, +a, c2a]).
[со́рак] :: ([=c1, c2, -s0]).
[дзеся́т] :: ([=c1, +c, c2, -s0]).
[дзеся́т] :: ([=c1, =c2c, c2, -s0]).
[] :: ([=c1, +c, c2c]).
[шэ́сцьдзесят] :: ([=c1, c2, -s0]).
[се́мдзесят] :: ([=c1, c2, -s0]).
[дзесят] :: ([=c1, +d, c2, -s0]).
[дзесят] :: ([=c1, =c2d, c2, -s0]).
[] :: ([=c1, +d, c2d]).
[дзевяно́ста] :: ([=c1, c2, -s0]).
[] :: ([=c1, c3]).
[] :: ([=c1, +i, c1]).
[] :: ([=c1, +d, c1]).
[] :: ([=c1, +c, c1]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c1, +g, c1]).
[] :: ([=c1, +f, c1]).
[] :: ([=c1, +h, c1]).
[] :: ([=c1, +a, c1]).
[] :: ([=c2, +e, c2]).
[] :: ([=c1, +i, +h, c1, -i]).
[] :: ([=c2, +e, +s0, c2, -e]).
[] :: ([=c1, +c, +h, c1, -c]).
[] :: ([=c1, +f, +a, c1, -f]).
