startCategory(cfin).
[] :: ([=c3, cfin]).
[едно] :: ([c1]).
[две] :: ([c1, -d]).
[три] :: ([c1, -d, -a]).
[четири] :: ([c1, -e, -a]).
[пет] :: ([c1, -e, -a]).
[шест] :: ([c1, -e, -a]).
[седем] :: ([c1, -e, -a]).
[осем] :: ([c1, -e, -a]).
[девет] :: ([c1, -e, -a]).
[десет] :: ([c2, -c]).
[единадесет] :: ([c2, -c]).
[дванадесет] :: ([c2, -c]).
[двадесет] :: ([c2, -c]).
[сто] :: ([c3]).
[сто_и] :: ([=c1, c3]).
[сто] :: ([=c3c, c3]).
[] :: ([=c2, +c, c3c]).
[ста] :: ([=c1, +d, c3]).
[ста_и] :: ([=c1, =c3d, c3]).
[] :: ([=c1, +d, c3d]).
[ста] :: ([=c3c, =c3d, c3]).
[стотин] :: ([=c1, +e, c3]).
[стотин_и] :: ([=c1, =c3e, c3]).
[] :: ([=c1, +e, c3e]).
[стотин] :: ([=c3c, =c3e, c3]).
[] :: ([=c2, c3]).
[надесет] :: ([=c1, +a, c2]).
[двадесет_и] :: ([=c1, c2]).
[десет] :: ([=c1, +a, c2]).
[десет_и] :: ([=c1, =c2a, c2]).
[] :: ([=c1, +a, c2a]).
[] :: ([=c1, c3]).
[] :: ([=c1, +e, c1]).
[] :: ([=c1, +d, c1]).
[] :: ([=c2, +c, c2]).
[] :: ([=c1, +a, c1]).
[] :: ([=c1, +d, +a, c1, -d]).
[] :: ([=c1, +e, +a, c1, -e]).
