startCategory(cfin).
[ᘰᗿ] :: ([c1]).
[ᒡᗡᘀᑊᗦ] :: ([c2, -c, -b, -s0]).
[ᘧᘅᙆᘒ] :: ([c2, -e, -s0]).
[] :: ([=c3, cfin]).
[ᘇᐣᗶᑋ] :: ([c2, -b, -s0]).
[ᗡᗿᑋ] :: ([c2, -b, -s0]).
[ᑔᐣᗿᑋ] :: ([c2, -b, -s0]).
[ᔆᐠᗒᐣᘧᐉ] :: ([c2, -b, -s0]).
[ᒡᗽᐪᗡᗿᑋ] :: ([c2, -b, -s0]).
[ᒡᗽᐪᑔᐣᗿᑋ] :: ([c2, -b, -s0]).
[] :: ([=c1, c2, -b]).
[ᘧᘅᙆᘒ_ᐧᐃᐧᐅᐣ] :: ([=c3b, c3]).
[] :: ([=c2, +b, c3b]).
[ᘇᐪ_ᘧᘅᙆᘒ] :: ([c3]).
[ᘇᐪ_ᘧᘅᙆᘒ_ᐧᐃᐧᐅᐣ] :: ([=c3b, c3]).
[ᗡᐪ_ᘧᘅᙆᘒ] :: ([c3]).
[ᗡᐪ_ᘧᘅᙆᘒ_ᐧᐃᐧᐅᐣ] :: ([=c3b, c3]).
[ᑔᐪ_ᘧᘅᙆᘒ] :: ([c3]).
[ᑔᐪ_ᘧᘅᙆᘒ_ᐧᐃᐧᐅᐣ] :: ([=c3b, c3]).
[ᔆᐠᗒᐣᘧᐪ_ᘧᘅᙆᘒ] :: ([c3]).
[ᔆᐠᗒᐣᘧᐪ_ᘧᘅᙆᘒ_ᐧᐃᐧᐅᐣ] :: ([=c3b, c3]).
[ᒡᗽᗡᐪ_ᘧᘅᙆᘒ] :: ([c3]).
[ᒡᗽᗡᐪ_ᘧᘅᙆᘒ_ᐧᐃᐧᐅᐣ] :: ([=c3b, c3]).
[ᐪ_ᘧᘅᙆᘒ] :: ([=c2, +c, c3]).
[ᐪ_ᘧᘅᙆᘒ_ᐧᐃᐧᐅᐣ] :: ([=c3b, =c3c, c3]).
[] :: ([=c2, +c, c3c]).
[ᒡᗽᑔᐪ_ᘧᘅᙆᘒ] :: ([c3]).
[ᒡᗽᑔᐪ_ᘧᘅᙆᘒ_ᐧᐃᐧᐅᐣ] :: ([=c3b, c3]).
[D_ᘧᘅᙆᘒ] :: ([c3]).
[D_ᘧᘅᙆᘒ_ᐧᐃᐧᐅᐣ] :: ([=c3b, c3]).
[ᒡᗽᐪᐧ] :: ([=c3e, c3]).
[] :: ([=c2, +e, c3e]).
[] :: ([=c2, +s0, c3]).
[ᐯᘣᑋ] :: ([=cnix, =c1, c2, -s0]).
[] :: ([cnix]).
[] :: ([=c1, c3]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c2, +c, c2]).
[] :: ([=c2, +b, c2]).
[] :: ([=c2, +e, c2]).
[] :: ([=c2, +e, +s0, c2, -e]).
[] :: ([=c2, +b, +s0, c2, -b]).
[] :: ([=c2, +c, +b, +s0, c2, -c]).
