startCategory(cfin).
[вун_пĕр] :: ([c1, -c, -d0]).
[] :: ([=c3, cfin]).
[иккĕ] :: ([c1, -b, -d0, -a]).
[виççĕ] :: ([c1, -b, -d0, -a]).
[тăваттă] :: ([c1, -b, -d0, -a]).
[пиллĕк] :: ([c1, -b, -d0]).
[улттă] :: ([c1, -b, -d0, -a]).
[çиччĕ] :: ([c1, -b, -d0, -a]).
[саккăр] :: ([c1, -b, -d0, -a]).
[тăххăр] :: ([c1, -b, -d0, -a]).
[çĕр] :: ([c3]).
[çĕр_пĕр] :: ([c3]).
[çĕр] :: ([=c3d, c3]).
[] :: ([=c2, +d, c3d]).
[ик_çĕр] :: ([c3]).
[ик_çĕр_пĕр] :: ([c3]).
[ик_çĕр] :: ([=c3d, c3]).
[виç_çĕр] :: ([c3]).
[виç_çĕр_пĕр] :: ([c3]).
[виç_çĕр] :: ([=c3d, c3]).
[тăватă_çĕр] :: ([c3]).
[тăватă_çĕр_пĕр] :: ([c3]).
[тăватă_çĕр] :: ([=c3d, c3]).
[пилĕк_çĕр] :: ([c3]).
[пилĕк_çĕр_пĕр] :: ([c3]).
[пилĕк_çĕр] :: ([=c3d, c3]).
[ултă_çĕр] :: ([c3]).
[ултă_çĕр_пĕр] :: ([c3]).
[ултă_çĕр] :: ([=c3d, c3]).
[çичĕ_çĕр] :: ([c3]).
[çичĕ_çĕр_пĕр] :: ([c3]).
[çичĕ_çĕр] :: ([=c3d, c3]).
[сакăр_çĕр] :: ([c3]).
[сакăр_çĕр_пĕр] :: ([c3]).
[сакăр_çĕр] :: ([=c3d, c3]).
[тăхăр_çĕр] :: ([c3]).
[тăхăр_çĕр_пĕр] :: ([c3]).
[тăхăр_çĕр] :: ([=c3d, c3]).
[] :: ([=c2, +s0, c3]).
[вун] :: ([=c2a, c2, -s0]).
[] :: ([=c1, +a, c2a]).
[вун_пиллĕк] :: ([c2, -s0, -d]).
[çирĕм] :: ([c2, -s0, -d]).
[çирĕм_пĕр] :: ([c2, -s0, -d]).
[çирĕм] :: ([=c2b, c2, -s0]).
[] :: ([=c1, +b, c2b]).
[вăтăр] :: ([c2, -s0, -d]).
[вăтăр_пĕр] :: ([c2, -s0, -d]).
[вăтăр] :: ([=c2b, c2, -s0]).
[хĕрĕх] :: ([c2, -s0, -d]).
[хĕрĕх_пĕр] :: ([c2, -s0, -d]).
[хĕрĕх] :: ([=c2b, c2, -s0]).
[аллă] :: ([c2, -s0, -d]).
[аллă_пĕр] :: ([c2, -s0, -d]).
[аллă] :: ([=c2b, c2, -s0]).
[утмăл] :: ([c2, -s0, -d]).
[утмăл_пĕр] :: ([c2, -s0, -d]).
[утмăл] :: ([=c2b, c2, -s0]).
[çитмĕль] :: ([c2, -s0, -d]).
[çитмĕль_пĕр] :: ([c2, -s0, -d]).
[çитмĕль] :: ([=c2b, c2, -s0]).
[сакăр_вуннă] :: ([c2, -s0, -d]).
[сакăр] :: ([=c2c, c2, -s0]).
[] :: ([=c1, +c, c2c]).
[сакăр_вун] :: ([=c2b, c2, -s0]).
[тăхăр_вуннă] :: ([c2, -s0, -d]).
[тăхăр] :: ([=c2c, c2, -s0]).
[тăхăр_вун] :: ([=c2b, c2, -s0]).
[] :: ([=c1, c3]).
[пĕрре] :: ([c1]).
[вуннă] :: ([c1, -d0]).
[] :: ([=c1, +d0, c2, -d]).
[] :: ([=c1, +b, c1]).
[] :: ([=c1, +c, c1]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c1, +a, c1]).
[] :: ([=c2, +d, c2]).
[] :: ([=c1, +d0, c1]).
[] :: ([=c1, +c, +d0, c1, -c]).
[] :: ([=c1, +d0, +a, c1, -d0]).
[] :: ([=c2, +s0, +d, c2, -s0]).
[] :: ([=c1, +b, +d0, +a, c1, -b]).
[] :: ([=c1, +b, +d0, c1, -b]).
