startCategory(cfin).
[θiyɛčɩs] :: ([c1, -b, -f]).
[opən] :: ([c2, -d, -e, -s0, -g]).
[] :: ([=c3, cfin]).
[mos] :: ([c1, -c, -f]).
[tᶿočɩs] :: ([c1, -c, -f]).
[taʔačɩs] :: ([c1, -c, -f]).
[čɩnuxʷ_šɛ] :: ([c2, -e, -s0, -g]).
[t̓əχmaɬ_šɛ] :: ([c2, -e, -s0, -g]).
[tɩgixʷaɬ_šɛ] :: ([c2, -e, -s0, -g]).
[] :: ([=c1, c2, -e]).
[paʔa] :: ([c1]).
[saʔa] :: ([c1, -f]).
[čɛlas] :: ([c1, -f]).
[t̓əxəm] :: ([c1, -f]).
[tɩgiχʷ] :: ([c1, -f]).
[təsɛʔɛč_hekʷ_ʔ] :: ([=c31s, c3]).
[hekʷ] :: ([=c1, =c31sd, c31s]).
[] :: ([=c2, +d, c31sd]).
[təsɛʔɛč_hekʷ_θamšɛ] :: ([c3]).
[təsɛʔɛč_hekʷ_θamšɛ_heykʷ] :: ([=c1, c3]).
[təsɛʔɛč_hekʷ] :: ([=c3e, c3]).
[] :: ([=c2, +e, c3e]).
[təsɛʔɛč] :: ([=cnix, =c1, c3]).
[] :: ([cnix]).
[təsɛʔɛč_heykʷ] :: ([=c3g, =c3f, c3]).
[] :: ([=c1, +f, c3f]).
[] :: ([=c2, +g, c3g]).
[] :: ([=c2, +s0, c3]).
[ʔopən_hekʷ] :: ([=c1, c2, -s0]).
[θamšɛ] :: ([c2, -s0, -g]).
[θamšɛ_heykʷ] :: ([=c1, c2, -s0]).
[čɩnuxʷ_šɛ_heykʷ] :: ([=c1, c2, -s0]).
[aɬšɛ] :: ([=c1, +b, c2, -s0]).
[aɬšɛ_heykʷ] :: ([=c1, =c2b, c2, -s0]).
[] :: ([=c1, +b, c2b]).
[t̓əχmaɬ_šɛ_heykʷ] :: ([=c1, c2, -s0]).
[aɬ_šɛ] :: ([=c1, +c, c2, -s0]).
[aɬ_šɛ_heykʷ] :: ([=c1, =c2c, c2, -s0]).
[] :: ([=c1, +c, c2c]).
[tɩgixʷaɬ_šɛ_heykʷ] :: ([=c1, c2, -s0]).
[] :: ([=c1, c3]).
[] :: ([=c1, c2, -g]).
[] :: ([=c1, +b, c1]).
[] :: ([=c2, +g, c2]).
[] :: ([=c1, +c, c1]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c1, +f, c1]).
[] :: ([=c2, +d, c2]).
[] :: ([=c2, +e, c2]).
[] :: ([=c1, +c, +f, c1, -c]).
[] :: ([=c2, +d, +e, +s0, +g, c2, -d]).
[] :: ([=c2, +e, +s0, +g, c2, -e]).
[] :: ([=c2, +s0, +g, c2, -s0]).
[] :: ([=c1, +b, +f, c1, -b]).
