startCategory(cfin).
[gàhan] :: ([c1, -a, -e1, -f0]).
[] :: ([=c4, cfin]).
[txìj] :: ([c2, -b, -c, -e0, -s1, -f]).
[tìnj] :: ([c2, -b, -c, -e0, -s1, -f]).
[hìn] :: ([c2, -b, -c, -e0, -s1, -f]).
[txìh] :: ([c2, -b, -e0, -s1, -d]).
[xàn] :: ([c2, -b, -e0, -s1, -d]).
[xùwìj] :: ([c2, -b, -e0, -s1, -d]).
[xàhnìnj] :: ([c2, -b, -e0, -s1, -d]).
[xìnùnh] :: ([c2, -b, -e0, -s1, -d]).
[xìnùnh_yàn] :: ([c2, -b, -e0, -s1, -d]).
[xìnùnh_wwìj] :: ([c2, -b, -e0, -s1, -d]).
[xìnùnh_wàhnìnj] :: ([c2, -b, -e0, -s1, -d]).
[kò] :: ([c3, -e, -s0]).
[kò_yàn] :: ([c3, -e, -s0]).
[kò_wwìj] :: ([c3, -e, -s0]).
[kò_wàhnìnj] :: ([c3, -e, -s0]).
[kò_hùnh] :: ([c3, -e, -s0]).
[kò_wàtành] :: ([c3, -e, -s0]).
[wìj_xxìyà] :: ([c3, -e, -s0]).
[wìj_xxìyà_yàn] :: ([c3, -e, -s0]).
[wìj_xxìyà_wwìj] :: ([c3, -e, -s0]).
[wìj_xxìyà_wàhnìnj] :: ([c3, -e, -s0]).
[wìj_xxìyà_hùnh] :: ([c3, -e, -s0]).
[wìj_xxìyà_wàtành] :: ([c3, -e, -s0]).
[wàhnìnj_xxìyà] :: ([c3, -e, -s0]).
[wàhnìnj_xxìyà_yàn] :: ([c3, -e, -s0]).
[wàhnìnj_xxìyà_wwìj] :: ([c3, -e, -s0]).
[wàhnìnj_xxìyà_wàhnìnj] :: ([c3, -e, -s0]).
[wàhnìnj_xxìyà_hùnh] :: ([c3, -e, -s0]).
[wàhnìnj_xxìyà_wàtành] :: ([c3, -e, -s0]).
[] :: ([=c2, +e0, c3, -e]).
[ùhunj] :: ([c2, -e0, -s1, -f]).
[wàtanj] :: ([c2, -e0, -s1, -f]).
[] :: ([=c1, +e1, c3, -e]).
[wàhnin] :: ([c1, -e1, -f0]).
[hngò_syéntu] :: ([c4]).
[hngò_syéntu_taá_hngò] :: ([c4]).
[hngò_syéntu_taá_wwìj] :: ([c4]).
[hngò_syéntu_taá] :: ([=c4e, c4]).
[] :: ([=c3, +e, c4e]).
[wwìj_syéntu] :: ([c4]).
[wwìj_syéntu_taá_hngò] :: ([c4]).
[wwìj_syéntu_taá_wwìj] :: ([c4]).
[wwìj_syéntu_taá] :: ([=c4e, c4]).
[syéntu] :: ([=c2, +f, c4]).
[syéntu_taá_hngò] :: ([=c2, +f, c4]).
[syéntu_taá_wwìj] :: ([=c2, +f, c4]).
[syéntu_taá] :: ([=c4e, =c4f, c4]).
[] :: ([=c2, +f, c4f]).
[] :: ([=c3, +s0, c4]).
[kò] :: ([=c31s, c3, -s0]).
[j] :: ([=c1, +a, c31s]).
[kò] :: ([=c3b, c3, -s0]).
[] :: ([=c2, +b, c3b]).
[wìj_xxìyà] :: ([=c32s, c3, -s0]).
[j] :: ([=c1, +a, c32s]).
[wìj_xxìyà] :: ([=c3c, c3, -s0]).
[] :: ([=c2, +c, c3c]).
[wwìj_xxìyà] :: ([=c3d, c3, -s0]).
[] :: ([=c2, +d, c3d]).
[wàhnìnj_xxìyà] :: ([=c33s, c3, -s0]).
[j] :: ([=c1, +a, c33s]).
[wàhnìnj_xxìyà] :: ([=c3b, c3, -s0]).
[j_xxìyà] :: ([=c1, +a, c3, -s0]).
[j_xxìyà_yàn] :: ([=c1, +a, c3, -s0]).
[j_xxìyà_wwìj] :: ([=c1, +a, c3, -s0]).
[j_xxìyà_wàhnìnj] :: ([=c1, +a, c3, -s0]).
[j_xxìyà] :: ([=c34s, =c3a, c3, -s0]).
[] :: ([=c1, +a, c3a]).
[j] :: ([=c1, +a, c34s]).
[j_xxìyà_hùnh] :: ([=c1, +a, c3, -s0]).
[j_xxìyà_wàtành] :: ([=c1, +a, c3, -s0]).
[j_xxìyà] :: ([=c3b, =c3a, c3, -s0]).
[] :: ([=c2, +s1, c4]).
[xì] :: ([=c21s, c2, -s1]).
[j] :: ([=c1, +a, c21s]).
[xìnùnh] :: ([=c22s, c2, -s1]).
[j] :: ([=c1, +a, c22s]).
[] :: ([=c1, c4]).
[hngòoj] :: ([c1]).
[wwìi] :: ([c1]).
[] :: ([=c1, +f0, c2, -f]).
[] :: ([=c2, +f, c2]).
[] :: ([=c2, +c, c2]).
[] :: ([=c2, +e0, c2]).
[] :: ([=c1, +e1, c1]).
[] :: ([=c3, +e, c3]).
[] :: ([=c1, +f0, c1]).
[] :: ([=c1, +a, c1]).
[] :: ([=c2, +s1, c2]).
[] :: ([=c2, +d, c2]).
[] :: ([=c3, +s0, c3]).
[] :: ([=c2, +b, c2]).
[] :: ([=c1, +a, +e1, +f0, c1, -a]).
[] :: ([=c2, +b, +c, +e0, +s1, +f, c2, -b]).
[] :: ([=c2, +e0, +s1, +d, c2, -e0]).
[] :: ([=c2, +b, +e0, +s1, +d, c2, -b]).
[] :: ([=c2, +s1, +f, c2, -s1]).
[] :: ([=c1, +e1, +f0, c1, -e1]).
[] :: ([=c2, +e0, +s1, +f, c2, -e0]).
[] :: ([=c2, +c, +e0, +s1, +f, c2, -c]).
[] :: ([=c3, +e, +s0, c3, -e]).
[] :: ([=c2, +s1, +d, c2, -s1]).
