startCategory(cfin).
[] :: ([=c3, cfin]).
[он] :: ([c2, -b, -s0]).
[йигирми] :: ([c2, -b, -s0]).
[отуз] :: ([c2, -b, -s0]).
[къыркъ] :: ([c2, -b, -s0]).
[элли] :: ([c2, -b, -s0]).
[алтмыш] :: ([c2, -b, -s0]).
[етмиш] :: ([c2, -b, -s0]).
[сексен] :: ([c2, -b, -s0]).
[докъсан] :: ([c2, -b, -s0]).
[] :: ([=c1, c2, -b]).
[бир] :: ([c1]).
[эки] :: ([c1, -c]).
[учь] :: ([c1, -c]).
[дёрт] :: ([c1, -c]).
[беш] :: ([c1, -c]).
[алты] :: ([c1, -c]).
[еди] :: ([c1, -c]).
[секиз] :: ([c1, -c]).
[докъуз] :: ([c1, -c]).
[юз] :: ([c3]).
[юз] :: ([=c3b, c3]).
[] :: ([=c2, +b, c3b]).
[юз] :: ([=c1, +c, c3]).
[юз] :: ([=c3b, =c3c, c3]).
[] :: ([=c1, +c, c3c]).
[] :: ([=c2, +s0, c3]).
[он] :: ([=c1, c2, -s0]).
[йигирми] :: ([=c1, c2, -s0]).
[отуз] :: ([=c1, c2, -s0]).
[къыркъ] :: ([=c1, c2, -s0]).
[элли] :: ([=c1, c2, -s0]).
[алтмыш] :: ([=c1, c2, -s0]).
[етмиш] :: ([=c1, c2, -s0]).
[сексен] :: ([=c1, c2, -s0]).
[докъсан] :: ([=c1, c2, -s0]).
[] :: ([=c1, c3]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c2, +b, c2]).
[] :: ([=c1, +c, c1]).
[] :: ([=c2, +b, +s0, c2, -b]).
