startCategory(cfin).
[] :: ([=c3, cfin]).
[dva] :: ([c1, -b, -a]).
[tři] :: ([c1, -b, -a, -f]).
[čtyři] :: ([c1, -b, -f]).
[jedna] :: ([c1]).
[pět] :: ([c1, -g]).
[šest] :: ([c1, -a, -g]).
[sedm] :: ([c1, -a, -d, -g]).
[osm] :: ([c1, -a, -d, -g]).
[devět] :: ([c1, -g]).
[deset] :: ([c2, -e, -s0]).
[jedenáct] :: ([c2, -e, -s0]).
[čtrnáct] :: ([c2, -e, -s0]).
[patnáct] :: ([c2, -e, -s0]).
[devatenáct] :: ([c2, -e, -s0]).
[padesát] :: ([c2, -e, -s0]).
[šedesát] :: ([c2, -e, -s0]).
[devadesát] :: ([c2, -e, -s0]).
[] :: ([=c1, c2, -e]).
[sto] :: ([c3]).
[sto] :: ([=c3e, c3]).
[] :: ([=c2, +e, c3e]).
[dvě_stě] :: ([c3]).
[dvě_stě] :: ([=c3e, c3]).
[sta] :: ([=c1, +f, c3]).
[sta] :: ([=c3e, =c3f, c3]).
[] :: ([=c1, +f, c3f]).
[set] :: ([=c1, +g, c3]).
[set] :: ([=c3e, =c3g, c3]).
[] :: ([=c1, +g, c3g]).
[] :: ([=c2, +s0, c3]).
[náct] :: ([=c1, +a, c2, -s0]).
[cet] :: ([=c1, +b, c2, -s0]).
[cet] :: ([=c1, =c2b, c2, -s0]).
[] :: ([=c1, +b, c2b]).
[padesát] :: ([=c1, c2, -s0]).
[šedesát] :: ([=c1, c2, -s0]).
[desát] :: ([=c1, +d, c2, -s0]).
[desát] :: ([=c1, =c2d, c2, -s0]).
[] :: ([=c1, +d, c2d]).
[devadesát] :: ([=c1, c2, -s0]).
[] :: ([=c1, c3]).
[] :: ([=c1, +d, c1]).
[] :: ([=c1, +b, c1]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c1, +g, c1]).
[] :: ([=c1, +f, c1]).
[] :: ([=c1, +a, c1]).
[] :: ([=c2, +e, c2]).
[] :: ([=c1, +b, +a, +f, c1, -b]).
[] :: ([=c2, +e, +s0, c2, -e]).
[] :: ([=c1, +a, +d, +g, c1, -a]).
[] :: ([=c1, +d, +g, c1, -d]).
[] :: ([=c1, +b, +a, c1, -b]).
[] :: ([=c1, +a, +g, c1, -a]).
[] :: ([=c1, +a, +f, c1, -a]).
[] :: ([=c1, +b, +f, c1, -b]).
