startCategory(cfin).
[] :: ([=c3, cfin]).
[enyɔ] :: ([c1, -b]).
[etɛ] :: ([c1, -b]).
[ejwɛ] :: ([c1, -b]).
[enumɔ] :: ([c1, -b]).
[ekpaa] :: ([c1, -b]).
[kpawo] :: ([c1, -b]).
[kpaanyɔ] :: ([c1, -b]).
[nɛɛhu] :: ([c1, -b]).
[nyɔŋma] :: ([c2, -c, -s0]).
[] :: ([=c1, c2, -c]).
[ekome] :: ([c1]).
[oha] :: ([c3]).
[oha_kɛ] :: ([=c31sc, c3]).
[] :: ([=c2, +c, c3c]).
[ohai] :: ([=c21sb, c3]).
[] :: ([=c1, +b, c3b]).
[ohai] :: ([=c31s, c3]).
[kɛ] :: ([=c31sc, =c21sb, c31s]).
[] :: ([=c1, +b, c31sb]).
[] :: ([=c2, +c, c31sc]).
[] :: ([=c2, +s0, c3]).
[nyɔŋma_kɛ] :: ([=c1, c2, -s0]).
[nyɔŋmai] :: ([=c21sb, c2, -s0]).
[] :: ([=c1, +b, c2b]).
[nyɔŋmai] :: ([=c21s, c2, -s0]).
[kɛ] :: ([=c1, =c21sb, c21s]).
[] :: ([=c1, +b, c21sb]).
[] :: ([=c1, c3]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c2, +c, c2]).
[] :: ([=c1, +b, c1]).
[] :: ([=c2, +c, +s0, c2, -c]).
