startCategory(cfin).
[ცხრა] :: ([c1, -a, -t, -d0]).
[ათი] :: ([c2, -q, -u0, -s1, -k, -i, -j, -g, -n0, -r0, -m, -l]).
[ჩვიდმეტი] :: ([c2, -c, -u0, -s1, -g, -n0, -r0]).
[ოცი] :: ([c3, -p, -u, -s0, -v, -n, -r]).
[] :: ([=c4, cfin]).
[ოცდაათი] :: ([c3, -u, -s0, -v]).
[] :: ([=c2, +u0, c3, -u]).
[თერთმეტი] :: ([c2, -u0, -s1, -k, -i, -j, -e, -d, -g, -n0, -r0, -b, -m, -f, -l]).
[თორმეტი] :: ([c2, -u0, -s1, -k, -j, -d, -g, -n0, -r0, -b, -m, -f, -l]).
[ცამეტი] :: ([c2, -u0, -s1, -k, -i, -j, -e, -d, -g, -n0, -r0, -b, -m, -f, -l]).
[თოთხმეტი] :: ([c2, -u0, -s1, -k, -i, -e, -d, -g, -n0, -r0, -b, -m, -f, -l]).
[თხუთმეტი] :: ([c2, -u0, -s1, -k, -j, -d, -g, -n0, -r0, -b, -m, -f]).
[თექვსმეტი] :: ([c2, -u0, -s1, -i, -j, -e, -d, -g, -n0, -r0, -b, -m, -l]).
[თვრამეტი] :: ([c2, -u0, -s1, -k, -i, -j, -e, -d, -g, -n0, -r0, -b, -m, -f]).
[რვა] :: ([c1, -t]).
[ორმოცი] :: ([c4]).
[ორმოცდა] :: ([=c4d, c4]).
[] :: ([=c2, +d, c4d]).
[ორმოცდარვა] :: ([c4]).
[ორმოცდაათი] :: ([c4]).
[ორმოცდამე] :: ([=c3c, c4]).
[] :: ([=c2, +c, c4c]).
[სამოცი] :: ([c4]).
[სამოცდა] :: ([=c4e, c4]).
[] :: ([=c2, +e, c4e]).
[სამოცდაათი] :: ([c4]).
[სამოცდათორმეტი] :: ([c4]).
[სამოცდათხუთმეტი] :: ([c4]).
[სამოცდამე] :: ([=c3c, c4]).
[ოთხმოცი] :: ([c4]).
[ოთხმოცდა] :: ([=c4f, c4]).
[] :: ([=c2, +f, c4f]).
[ოთხმოცდაათი] :: ([c4]).
[ოთხმოცდათექვსმეტი] :: ([c4]).
[ოთხმოცდამე] :: ([=c3c, c4]).
[ასი] :: ([c4]).
[ას] :: ([=c4g, c4]).
[] :: ([=c2, +g, c4g]).
[ას] :: ([=c1, c4]).
[ას_ოცი] :: ([c4]).
[ას_ოცდა] :: ([=c4i, c4]).
[] :: ([=c2, +i, c4i]).
[ას_ოცდათორმეტი] :: ([c4]).
[ას_ოცდათხუთმეტი] :: ([c4]).
[ას_ოცდამე] :: ([=c3c, c4]).
[ას_ორმოცი] :: ([c4]).
[ას_ორმოცდა] :: ([=c4j, c4]).
[] :: ([=c2, +j, c4j]).
[ას_ორმოცდათოთხმეტი] :: ([c4]).
[ას_ორმოცდამე] :: ([=c3c, c4]).
[ას_სამოცი] :: ([c4]).
[ას_სამოცდა] :: ([=c4k, c4]).
[] :: ([=c2, +k, c4k]).
[ას_სამოცდათექვსმეტი] :: ([c4]).
[ას_სამოცდამე] :: ([=c3c, c4]).
[ას_ოთხმოცი] :: ([c4]).
[ას_ოთხმოცდა] :: ([=c4l, c4]).
[] :: ([=c2, +l, c4l]).
[ას_ოთხმოცდათხუთმეტი] :: ([c4]).
[ას_ოთხმოცდამე] :: ([=c3c, c4]).
[ას_ოთხმოცდათვრამეტი] :: ([c4]).
[ორასი] :: ([c4]).
[ორას] :: ([=c1, c4]).
[ორას] :: ([=c4g, c4]).
[ორას_ოცი] :: ([c4]).
[ორას_ოცდა] :: ([=c4m, c4]).
[] :: ([=c2, +m, c4m]).
[ორას_ოცდამე] :: ([=c3c, c4]).
[ორას_ორმოცი] :: ([c4]).
[ორას_ორმოცდა] :: ([=c4m, c4]).
[ორას_ორმოცდამე] :: ([=c3c, c4]).
[ორას_სამოცი] :: ([c4]).
[ორას_სამოცდა] :: ([=c4m, c4]).
[ორას_სამოცდამე] :: ([=c3c, c4]).
[ორას_ოთხმოცი] :: ([c4]).
[ორას_ოთხმოცდა] :: ([=c4m, c4]).
[ორას_ოთხმოცდამე] :: ([=c3c, c4]).
[სამასი] :: ([c4]).
[სამას] :: ([=c1, c4]).
[სამას] :: ([=c4g, c4]).
[სამას_ოცი] :: ([c4]).
[სამას_ოცდა] :: ([=c4m, c4]).
[სამას_ოცდამე] :: ([=c3c, c4]).
[სამას_ორმოცი] :: ([c4]).
[სამას_ორმოცდა] :: ([=c4m, c4]).
[სამას_ორმოცდამე] :: ([=c3c, c4]).
[სამას_სამოცი] :: ([c4]).
[სამას_სამოცდა] :: ([=c4m, c4]).
[სამას_სამოცდამე] :: ([=c3c, c4]).
[სამას_ოთხმოცი] :: ([c4]).
[სამას_ოთხმოცდა] :: ([=c4m, c4]).
[სამას_ოთხმოცდამე] :: ([=c3c, c4]).
[ოთხასი] :: ([c4]).
[ოთხას] :: ([=c1, c4]).
[ოთხას] :: ([=c4n, c4]).
[] :: ([=c3, +n, c4n]).
[ოთხას_ოცდა] :: ([=c4m, c4]).
[ოთხას_ოცდამე] :: ([=c3c, c4]).
[ოთხას_ორმ] :: ([=c4p, c4]).
[] :: ([=c3, +p, c4p]).
[ოთხას_ორმოცდა] :: ([=c4q, c4]).
[] :: ([=c2, +q, c4q]).
[ოთხას_ორმოცდამე] :: ([=c3c, c4]).
[ოთხას_სამ] :: ([=c4p, c4]).
[ოთხას_სამოცდა] :: ([=c4q, c4]).
[ოთხას_სამოცდამე] :: ([=c3c, c4]).
[ოთხას_ოთხმ] :: ([=c4p, c4]).
[ოთხას_ოთხმოცდა] :: ([=c4q, c4]).
[ოთხას_ოთხმოცდამე] :: ([=c3c, c4]).
[ხუთასი] :: ([c4]).
[ხუთას] :: ([=c1, c4]).
[ხუთას] :: ([=c4r, c4]).
[] :: ([=c3, +r, c4r]).
[ხუთას_ოცდა] :: ([=c4q, c4]).
[ხუთას_ოცდამე] :: ([=c3c, c4]).
[ხუთას_ორმ] :: ([=c4p, c4]).
[ხუთას_ორმოცდა] :: ([=c4q, c4]).
[ხუთას_ორმოცდამე] :: ([=c3c, c4]).
[ხუთას_სამ] :: ([=c4p, c4]).
[ხუთას_სამოცდა] :: ([=c4q, c4]).
[ხუთას_სამოცდამე] :: ([=c3c, c4]).
[ხუთას_ოთხმ] :: ([=c4p, c4]).
[ხუთას_ოთხმოცდა] :: ([=c4q, c4]).
[ხუთას_ოთხმოცდამე] :: ([=c3c, c4]).
[ექვსასი] :: ([c4]).
[ექვსას] :: ([=c1, c4]).
[ექვსას] :: ([=c4r, c4]).
[ექვსას_ოცდა] :: ([=c4q, c4]).
[ექვსას_ოცდამე] :: ([=c3c, c4]).
[ექვსას_ორმ] :: ([=c4p, c4]).
[ექვსას_ორმოცდა] :: ([=c4q, c4]).
[ექვსას_ორმოცდამე] :: ([=c3c, c4]).
[ექვსას_სამ] :: ([=c4p, c4]).
[ექვსას_სამოცდა] :: ([=c4q, c4]).
[ექვსას_სამოცდამე] :: ([=c3c, c4]).
[ექვსას_ოთხმ] :: ([=c4p, c4]).
[ექვსას_ოთხმოცდა] :: ([=c4q, c4]).
[ექვსას_ოთხმოცდამე] :: ([=c3c, c4]).
[შვიდასი] :: ([c4]).
[შვიდას] :: ([=c1, c4]).
[შვიდას] :: ([=c4r, c4]).
[შვიდას_ოცდა] :: ([=c4q, c4]).
[შვიდას_ოცდამე] :: ([=c3c, c4]).
[შვიდას_ორმ] :: ([=c4p, c4]).
[შვიდას_ორმოცდა] :: ([=c4q, c4]).
[შვიდას_ორმოცდამე] :: ([=c3c, c4]).
[შვიდას_სამ] :: ([=c4p, c4]).
[შვიდას_სამოცდა] :: ([=c4q, c4]).
[შვიდას_სამოცდამე] :: ([=c3c, c4]).
[შვიდას_ოთხმ] :: ([=c4p, c4]).
[შვიდას_ოთხმოცდა] :: ([=c4q, c4]).
[შვიდას_ოთხმოცდამე] :: ([=c3c, c4]).
[ას_ოცდა] :: ([=c4q, =c4, c4]).
[ას_ორმოცდა] :: ([=c4q, =c4, c4]).
[ას_სამოცდა] :: ([=c4q, =c4, c4]).
[ას_ოთხმოცდა] :: ([=c4q, =c4, c4]).
[ასი] :: ([=c1, +t, c4]).
[ას] :: ([=c1, =c4t, c4]).
[] :: ([=c1, +t, c4t]).
[ას] :: ([=c4u, =c4t, c4]).
[] :: ([=c3, +u, c4u]).
[ას_ოცდამე] :: ([=c3c, =c4t, c4]).
[ას_ორმ] :: ([=c4v, =c4t, c4]).
[] :: ([=c3, +v, c4v]).
[ას_ორმოცდამე] :: ([=c3c, =c4t, c4]).
[ას_სამ] :: ([=c4v, =c4t, c4]).
[ას_სამოცდამე] :: ([=c3c, =c4t, c4]).
[ას_ოთხმ] :: ([=c4v, =c4t, c4]).
[ას_ოთხმოცდამე] :: ([=c3c, =c4t, c4]).
[] :: ([=c3, +s0, c4]).
[ოცდა] :: ([=c3b, c3, -s0]).
[] :: ([=c2, +b, c3b]).
[ოცდამე] :: ([=c3c, c3, -s0]).
[] :: ([=c2, +c, c3c]).
[] :: ([=c2, +s1, c4]).
[მეტი] :: ([=c1, +a, c2, -s1]).
[] :: ([=c1, c4]).
[ერთი] :: ([c1, -d0]).
[ორი] :: ([c1, -d0]).
[სამი] :: ([c1, -d0]).
[ოთხი] :: ([c1, -d0]).
[ხუთი] :: ([c1, -d0]).
[ექვსი] :: ([c1, -d0]).
[შვიდი] :: ([c1, -d0]).
[] :: ([=c1, c2, -k]).
[] :: ([=c1, c2, -i]).
[] :: ([=c1, c2, -j]).
[] :: ([=c1, c2, -e]).
[] :: ([=c1, +d0, c2, -d]).
[] :: ([=c2, +n0, c3, -n]).
[] :: ([=c2, +r0, c3, -r]).
[] :: ([=c1, c2, -b]).
[] :: ([=c1, c2, -m]).
[] :: ([=c1, c2, -f]).
[] :: ([=c1, c2, -l]).
[] :: ([=c2, +u0, c2]).
[] :: ([=c3, +r, c3]).
[] :: ([=c2, +d, c2]).
[] :: ([=c3, +n, c3]).
[] :: ([=c1, +d0, c1]).
[] :: ([=c2, +k, c2]).
[] :: ([=c2, +c, c2]).
[] :: ([=c2, +n0, c2]).
[] :: ([=c2, +r0, c2]).
[] :: ([=c2, +i, c2]).
[] :: ([=c3, +s0, c3]).
[] :: ([=c2, +e, c2]).
[] :: ([=c2, +q, c2]).
[] :: ([=c2, +f, c2]).
[] :: ([=c2, +j, c2]).
[] :: ([=c2, +g, c2]).
[] :: ([=c3, +p, c3]).
[] :: ([=c1, +a, c1]).
[] :: ([=c2, +s1, c2]).
[] :: ([=c3, +v, c3]).
[] :: ([=c2, +b, c2]).
[] :: ([=c3, +u, c3]).
[] :: ([=c2, +m, c2]).
[] :: ([=c1, +t, c1]).
[] :: ([=c2, +l, c2]).
[] :: ([=c2, +d, +g, +n0, +r0, +b, +m, +f, +l, c2, -d]).
[] :: ([=c2, +g, +n0, +r0, +b, +m, +f, c2, -g]).
[] :: ([=c2, +g, +n0, +r0, +m, +l, c2, -g]).
[] :: ([=c2, +u0, +s1, +k, +i, +e, +d, +g, +n0, +r0, +b, +m, +f, +l, c2, -u0]).
[] :: ([=c2, +i, +j, +e, +d, +g, +n0, +r0, +b, +m, +f, +l, c2, -i]).
[] :: ([=c2, +c, +u0, +s1, +g, +n0, +r0, c2, -c]).
[] :: ([=c3, +u, +s0, +v, c3, -u]).
[] :: ([=c2, +r0, +b, +m, +l, c2, -r0]).
[] :: ([=c2, +j, +e, +d, +g, +n0, +r0, +b, +m, +f, +l, c2, -j]).
[] :: ([=c2, +k, +i, +j, +e, +d, +g, +n0, +r0, +b, +m, +f, +l, c2, -k]).
[] :: ([=c2, +b, +m, +l, c2, -b]).
[] :: ([=c2, +d, +g, +n0, +r0, +b, +m, +l, c2, -d]).
[] :: ([=c2, +g, +n0, +r0, +b, +m, +l, c2, -g]).
[] :: ([=c2, +u0, +s1, +k, +i, +j, +e, +d, +g, +n0, +r0, +b, +m, +f, +l, c2, -u0]).
[] :: ([=c3, +v, +n, +r, c3, -v]).
[] :: ([=c2, +i, +e, +d, +g, +n0, +r0, +b, +m, +f, +l, c2, -i]).
[] :: ([=c2, +b, +m, +f, c2, -b]).
[] :: ([=c2, +i, +j, +g, +n0, +r0, +m, +l, c2, -i]).
[] :: ([=c2, +q, +u0, +s1, +k, +i, +j, +g, +n0, +r0, +m, +l, c2, -q]).
[] :: ([=c1, +a, +t, +d0, c1, -a]).
[] :: ([=c2, +m, +f, c2, -m]).
[] :: ([=c2, +j, +e, +d, +g, +n0, +r0, +b, +m, +l, c2, -j]).
[] :: ([=c2, +m, +f, +l, c2, -m]).
[] :: ([=c2, +u0, +s1, +k, +j, +d, +g, +n0, +r0, +b, +m, +f, +l, c2, -u0]).
[] :: ([=c2, +s1, +k, +i, +j, +e, +d, +g, +n0, +r0, +b, +m, +f, +l, c2, -s1]).
[] :: ([=c2, +n0, +r0, +b, +m, +f, +l, c2, -n0]).
[] :: ([=c2, +i, +j, +e, +d, +g, +n0, +r0, +b, +m, +l, c2, -i]).
[] :: ([=c2, +k, +j, +d, +g, +n0, +r0, +b, +m, +f, c2, -k]).
[] :: ([=c2, +e, +d, +g, +n0, +r0, +b, +m, +l, c2, -e]).
[] :: ([=c2, +u0, +s1, +k, +j, +d, +g, +n0, +r0, +b, +m, +f, c2, -u0]).
[] :: ([=c1, +t, +d0, c1, -t]).
[] :: ([=c2, +n0, +r0, +b, +m, +f, c2, -n0]).
[] :: ([=c2, +s1, +k, +i, +j, +g, +n0, +r0, +m, +l, c2, -s1]).
[] :: ([=c2, +s1, +k, +j, +d, +g, +n0, +r0, +b, +m, +f, c2, -s1]).
[] :: ([=c2, +u0, +s1, +k, +i, +j, +g, +n0, +r0, +m, +l, c2, -u0]).
[] :: ([=c2, +r0, +b, +m, +f, +l, c2, -r0]).
[] :: ([=c2, +s1, +g, +n0, +r0, c2, -s1]).
[] :: ([=c2, +u0, +s1, +g, +n0, +r0, c2, -u0]).
[] :: ([=c2, +g, +n0, +r0, c2, -g]).
[] :: ([=c2, +b, +m, +f, +l, c2, -b]).
[] :: ([=c2, +j, +g, +n0, +r0, +m, +l, c2, -j]).
[] :: ([=c2, +k, +i, +j, +g, +n0, +r0, +m, +l, c2, -k]).
[] :: ([=c2, +g, +n0, +r0, +b, +m, +f, +l, c2, -g]).
[] :: ([=c2, +s1, +k, +j, +d, +g, +n0, +r0, +b, +m, +f, +l, c2, -s1]).
[] :: ([=c2, +f, +l, c2, -f]).
[] :: ([=c2, +s1, +i, +j, +e, +d, +g, +n0, +r0, +b, +m, +l, c2, -s1]).
[] :: ([=c2, +n0, +r0, +m, +l, c2, -n0]).
[] :: ([=c2, +m, +l, c2, -m]).
[] :: ([=c2, +u0, +s1, +i, +j, +e, +d, +g, +n0, +r0, +b, +m, +l, c2, -u0]).
[] :: ([=c3, +p, +u, +s0, +v, +n, +r, c3, -p]).
[] :: ([=c2, +k, +i, +j, +e, +d, +g, +n0, +r0, +b, +m, +f, c2, -k]).
[] :: ([=c2, +n0, +r0, c2, -n0]).
[] :: ([=c2, +s1, +k, +i, +e, +d, +g, +n0, +r0, +b, +m, +f, +l, c2, -s1]).
[] :: ([=c2, +d, +g, +n0, +r0, +b, +m, +f, c2, -d]).
[] :: ([=c2, +n0, +r0, +b, +m, +l, c2, -n0]).
[] :: ([=c2, +s1, +k, +i, +j, +e, +d, +g, +n0, +r0, +b, +m, +f, c2, -s1]).
[] :: ([=c2, +k, +j, +d, +g, +n0, +r0, +b, +m, +f, +l, c2, -k]).
[] :: ([=c2, +e, +d, +g, +n0, +r0, +b, +m, +f, +l, c2, -e]).
[] :: ([=c2, +j, +d, +g, +n0, +r0, +b, +m, +f, c2, -j]).
[] :: ([=c2, +i, +j, +e, +d, +g, +n0, +r0, +b, +m, +f, c2, -i]).
[] :: ([=c2, +e, +d, +g, +n0, +r0, +b, +m, +f, c2, -e]).
[] :: ([=c3, +s0, +v, +n, +r, c3, -s0]).
[] :: ([=c2, +k, +i, +e, +d, +g, +n0, +r0, +b, +m, +f, +l, c2, -k]).
[] :: ([=c3, +n, +r, c3, -n]).
[] :: ([=c2, +r0, +b, +m, +f, c2, -r0]).
[] :: ([=c2, +j, +d, +g, +n0, +r0, +b, +m, +f, +l, c2, -j]).
[] :: ([=c2, +r0, +m, +l, c2, -r0]).
[] :: ([=c3, +s0, +v, c3, -s0]).
[] :: ([=c3, +u, +s0, +v, +n, +r, c3, -u]).
[] :: ([=c2, +j, +e, +d, +g, +n0, +r0, +b, +m, +f, c2, -j]).
[] :: ([=c2, +u0, +s1, +k, +i, +j, +e, +d, +g, +n0, +r0, +b, +m, +f, c2, -u0]).
