startCategory(cFin).
[ცხრა] :: ([c1, -al, -tl, -dl0]).
[ათი] :: ([c2, -ql, -ul0, -sl1, -kl, -il, -jl, -gl, -nl0, -rl0, -ml, -ll]).
[ჩვიდმეტი] :: ([c2, -cl, -ul0, -sl1, -gl, -nl0, -rl0]).
[ოცი] :: ([c3, -pl, -ul, -sl0, -vl, -nl, -rl]).
[ოცდაათი] :: ([c3, -ul, -sl0, -vl]).
[თერთმეტი] :: ([c2, -ul0, -sl1, -kl, -il, -jl, -el, -dl, -gl, -nl0, -rl0, -bl, -ml, -fl, -ll]).
[თორმეტი] :: ([c2, -ul0, -sl1, -kl, -jl, -dl, -gl, -nl0, -rl0, -bl, -ml, -fl, -ll]).
[ცამეტი] :: ([c2, -ul0, -sl1, -kl, -il, -jl, -el, -dl, -gl, -nl0, -rl0, -bl, -ml, -fl, -ll]).
[თოთხმეტი] :: ([c2, -ul0, -sl1, -kl, -il, -el, -dl, -gl, -nl0, -rl0, -bl, -ml, -fl, -ll]).
[თხუთმეტი] :: ([c2, -ul0, -sl1, -kl, -jl, -dl, -gl, -nl0, -rl0, -bl, -ml, -fl]).
[თექვსმეტი] :: ([c2, -ul0, -sl1, -il, -jl, -el, -dl, -gl, -nl0, -rl0, -bl, -ml, -ll]).
[თვრამეტი] :: ([c2, -ul0, -sl1, -kl, -il, -jl, -el, -dl, -gl, -nl0, -rl0, -bl, -ml, -fl]).
[რვა] :: ([c1, -tl]).
[ორმოცი] :: ([c4]).
[ორმოცდა] :: ([=c4dl, c4]).
[ორმოცდარვა] :: ([c4]).
[ორმოცდაათი] :: ([c4]).
[ორმოცდამე] :: ([=c3cl, c4]).
[სამოცი] :: ([c4]).
[სამოცდა] :: ([=c4el, c4]).
[სამოცდაათი] :: ([c4]).
[სამოცდათორმეტი] :: ([c4]).
[სამოცდათხუთმეტი] :: ([c4]).
[სამოცდამე] :: ([=c3cl, c4]).
[ოთხმოცი] :: ([c4]).
[ოთხმოცდა] :: ([=c4fl, c4]).
[ოთხმოცდაათი] :: ([c4]).
[ოთხმოცდათექვსმეტი] :: ([c4]).
[ოთხმოცდამე] :: ([=c3cl, c4]).
[ასი] :: ([c4]).
[ას] :: ([=c4gl, c4]).
[ას] :: ([=c1, c4]).
[ას_ოცი] :: ([c4]).
[ას_ოცდა] :: ([=c4il, c4]).
[ას_ოცდათორმეტი] :: ([c4]).
[ას_ოცდათხუთმეტი] :: ([c4]).
[ას_ოცდამე] :: ([=c3cl, c4]).
[ას_ორმოცი] :: ([c4]).
[ას_ორმოცდა] :: ([=c4jl, c4]).
[ას_ორმოცდათოთხმეტი] :: ([c4]).
[ას_ორმოცდამე] :: ([=c3cl, c4]).
[ას_სამოცი] :: ([c4]).
[ას_სამოცდა] :: ([=c4kl, c4]).
[ას_სამოცდათექვსმეტი] :: ([c4]).
[ას_სამოცდამე] :: ([=c3cl, c4]).
[ას_ოთხმოცი] :: ([c4]).
[ას_ოთხმოცდა] :: ([=c4ll, c4]).
[ას_ოთხმოცდათხუთმეტი] :: ([c4]).
[ას_ოთხმოცდამე] :: ([=c3cl, c4]).
[ას_ოთხმოცდათვრამეტი] :: ([c4]).
[ორასი] :: ([c4]).
[ორას] :: ([=c1, c4]).
[ორას] :: ([=c4gl, c4]).
[ორას_ოცი] :: ([c4]).
[ორას_ოცდა] :: ([=c4ml, c4]).
[ორას_ოცდამე] :: ([=c3cl, c4]).
[ორას_ორმოცი] :: ([c4]).
[ორას_ორმოცდა] :: ([=c4ml, c4]).
[ორას_ორმოცდამე] :: ([=c3cl, c4]).
[ორას_სამოცი] :: ([c4]).
[ორას_სამოცდა] :: ([=c4ml, c4]).
[ორას_სამოცდამე] :: ([=c3cl, c4]).
[ორას_ოთხმოცი] :: ([c4]).
[ორას_ოთხმოცდა] :: ([=c4ml, c4]).
[ორას_ოთხმოცდამე] :: ([=c3cl, c4]).
[სამასი] :: ([c4]).
[სამას] :: ([=c1, c4]).
[სამას] :: ([=c4gl, c4]).
[სამას_ოცი] :: ([c4]).
[სამას_ოცდა] :: ([=c4ml, c4]).
[სამას_ოცდამე] :: ([=c3cl, c4]).
[სამას_ორმოცი] :: ([c4]).
[სამას_ორმოცდა] :: ([=c4ml, c4]).
[სამას_ორმოცდამე] :: ([=c3cl, c4]).
[სამას_სამოცი] :: ([c4]).
[სამას_სამოცდა] :: ([=c4ml, c4]).
[სამას_სამოცდამე] :: ([=c3cl, c4]).
[სამას_ოთხმოცი] :: ([c4]).
[სამას_ოთხმოცდა] :: ([=c4ml, c4]).
[სამას_ოთხმოცდამე] :: ([=c3cl, c4]).
[ოთხასი] :: ([c4]).
[ოთხას] :: ([=c1, c4]).
[ოთხას] :: ([=c4nl, c4]).
[ოთხას_ოცდა] :: ([=c4ml, c4]).
[ოთხას_ოცდამე] :: ([=c3cl, c4]).
[ოთხას_ორმ] :: ([=c4pl, c4]).
[ოთხას_ორმოცდა] :: ([=c4ql, c4]).
[ოთხას_ორმოცდამე] :: ([=c3cl, c4]).
[ოთხას_სამ] :: ([=c4pl, c4]).
[ოთხას_სამოცდა] :: ([=c4ql, c4]).
[ოთხას_სამოცდამე] :: ([=c3cl, c4]).
[ოთხას_ოთხმ] :: ([=c4pl, c4]).
[ოთხას_ოთხმოცდა] :: ([=c4ql, c4]).
[ოთხას_ოთხმოცდამე] :: ([=c3cl, c4]).
[ხუთასი] :: ([c4]).
[ხუთას] :: ([=c1, c4]).
[ხუთას] :: ([=c4rl, c4]).
[ხუთას_ოცდა] :: ([=c4ql, c4]).
[ხუთას_ოცდამე] :: ([=c3cl, c4]).
[ხუთას_ორმ] :: ([=c4pl, c4]).
[ხუთას_ორმოცდა] :: ([=c4ql, c4]).
[ხუთას_ორმოცდამე] :: ([=c3cl, c4]).
[ხუთას_სამ] :: ([=c4pl, c4]).
[ხუთას_სამოცდა] :: ([=c4ql, c4]).
[ხუთას_სამოცდამე] :: ([=c3cl, c4]).
[ხუთას_ოთხმ] :: ([=c4pl, c4]).
[ხუთას_ოთხმოცდა] :: ([=c4ql, c4]).
[ხუთას_ოთხმოცდამე] :: ([=c3cl, c4]).
[ექვსასი] :: ([c4]).
[ექვსას] :: ([=c1, c4]).
[ექვსას] :: ([=c4rl, c4]).
[ექვსას_ოცდა] :: ([=c4ql, c4]).
[ექვსას_ოცდამე] :: ([=c3cl, c4]).
[ექვსას_ორმ] :: ([=c4pl, c4]).
[ექვსას_ორმოცდა] :: ([=c4ql, c4]).
[ექვსას_ორმოცდამე] :: ([=c3cl, c4]).
[ექვსას_სამ] :: ([=c4pl, c4]).
[ექვსას_სამოცდა] :: ([=c4ql, c4]).
[ექვსას_სამოცდამე] :: ([=c3cl, c4]).
[ექვსას_ოთხმ] :: ([=c4pl, c4]).
[ექვსას_ოთხმოცდა] :: ([=c4ql, c4]).
[ექვსას_ოთხმოცდამე] :: ([=c3cl, c4]).
[შვიდასი] :: ([c4]).
[შვიდას] :: ([=c1, c4]).
[შვიდას] :: ([=c4rl, c4]).
[შვიდას_ოცდა] :: ([=c4ql, c4]).
[შვიდას_ოცდამე] :: ([=c3cl, c4]).
[შვიდას_ორმ] :: ([=c4pl, c4]).
[შვიდას_ორმოცდა] :: ([=c4ql, c4]).
[შვიდას_ორმოცდამე] :: ([=c3cl, c4]).
[შვიდას_სამ] :: ([=c4pl, c4]).
[შვიდას_სამოცდა] :: ([=c4ql, c4]).
[შვიდას_სამოცდამე] :: ([=c3cl, c4]).
[შვიდას_ოთხმ] :: ([=c4pl, c4]).
[შვიდას_ოთხმოცდა] :: ([=c4ql, c4]).
[შვიდას_ოთხმოცდამე] :: ([=c3cl, c4]).
[ას_ოცდა] :: ([=c4ql, =c4, c4]).
[ას_ორმოცდა] :: ([=c4ql, =c4, c4]).
[ას_სამოცდა] :: ([=c4ql, =c4, c4]).
[ას_ოთხმოცდა] :: ([=c4ql, =c4, c4]).
[ასი] :: ([=c1, +tl, c4]).
[ას] :: ([=c1, =c4tl, c4]).
[ას] :: ([=c4ul, =c4tl, c4]).
[ას_ოცდამე] :: ([=c3cl, =c4tl, c4]).
[ას_ორმ] :: ([=c4vl, =c4tl, c4]).
[ას_ორმოცდამე] :: ([=c3cl, =c4tl, c4]).
[ას_სამ] :: ([=c4vl, =c4tl, c4]).
[ას_სამოცდამე] :: ([=c3cl, =c4tl, c4]).
[ას_ოთხმ] :: ([=c4vl, =c4tl, c4]).
[ას_ოთხმოცდამე] :: ([=c3cl, =c4tl, c4]).
[ოცდა] :: ([=c3bl, c3, -sl0]).
[ოცდამე] :: ([=c3cl, c3, -sl0]).
[მეტი] :: ([=c1, +al, c2, -sl1]).
[ერთი] :: ([c1, -dl0]).
[ორი] :: ([c1, -dl0]).
[სამი] :: ([c1, -dl0]).
[ოთხი] :: ([c1, -dl0]).
[ხუთი] :: ([c1, -dl0]).
[ექვსი] :: ([c1, -dl0]).
[შვიდი] :: ([c1, -dl0]).
[] :: ([=c4, cFin]).
[] :: ([=c1, c2, -kl]).
[] :: ([=c2, +dl, c4dl]).
[] :: ([=c2, +cl, c4cl]).
[] :: ([=c2, +ul0, c3, -ul]).
[] :: ([=c2, +fl, c4fl]).
[] :: ([=c2, +el, c4el]).
[] :: ([=c2, +gl, c4gl]).
[] :: ([=c2, +il, c4il]).
[] :: ([=c2, +jl, c4jl]).
[] :: ([=c3, +nl, c4nl]).
[] :: ([=c1, c2, -il]).
[] :: ([=c1, c2, -jl]).
[] :: ([=c1, c4]).
[] :: ([=c1, c2, -el]).
[] :: ([=c2, +ll, c4ll]).
[] :: ([=c2, +ml, c4ml]).
[] :: ([=c2, +kl, c4kl]).
[] :: ([=c1, +dl0, c2, -dl]).
[] :: ([=c3, +ul, c4ul]).
[] :: ([=c1, +tl, c4tl]).
[] :: ([=c2, +cl, c3cl]).
[] :: ([=c2, +sl1, c4]).
[] :: ([=c3, +rl, c4rl]).
[] :: ([=c2, +ql, c4ql]).
[] :: ([=c2, +nl0, c3, -nl]).
[] :: ([=c3, +sl0, c4]).
[] :: ([=c2, +rl0, c3, -rl]).
[] :: ([=c3, +pl, c4pl]).
[] :: ([=c3, +vl, c4vl]).
[] :: ([=c1, c2, -bl]).
[] :: ([=c1, c2, -ml]).
[] :: ([=c1, c2, -fl]).
[] :: ([=c1, c2, -ll]).
[] :: ([=c2, +ul0, c2]).
[] :: ([=c2, +bl, c3bl]).
[] :: ([=c3, +rl, c3]).
[] :: ([=c2, +dl, c2]).
[] :: ([=c3, +nl, c3]).
[] :: ([=c1, +dl0, c1]).
[] :: ([=c2, +kl, c2]).
[] :: ([=c2, +cl, c2]).
[] :: ([=c2, +nl0, c2]).
[] :: ([=c2, +rl0, c2]).
[] :: ([=c2, +il, c2]).
[] :: ([=c3, +sl0, c3]).
[] :: ([=c2, +el, c2]).
[] :: ([=c2, +ql, c2]).
[] :: ([=c2, +fl, c2]).
[] :: ([=c2, +jl, c2]).
[] :: ([=c2, +gl, c2]).
[] :: ([=c3, +pl, c3]).
[] :: ([=c1, +al, c1]).
[] :: ([=c2, +sl1, c2]).
[] :: ([=c3, +vl, c3]).
[] :: ([=c2, +bl, c2]).
[] :: ([=c3, +ul, c3]).
[] :: ([=c2, +ml, c2]).
[] :: ([=c1, +tl, c1]).
[] :: ([=c2, +ll, c2]).
[] :: ([=c2, +dl, +gl, +nl0, +rl0, +bl, +ml, +fl, +ll, c2, -dl]).
[] :: ([=c2, +gl, +nl0, +rl0, +bl, +ml, +fl, c2, -gl]).
[] :: ([=c2, +gl, +nl0, +rl0, +ml, +ll, c2, -gl]).
[] :: ([=c2, +ul0, +sl1, +kl, +il, +el, +dl, +gl, +nl0, +rl0, +bl, +ml, +fl, +ll, c2, -ul0]).
[] :: ([=c2, +il, +jl, +el, +dl, +gl, +nl0, +rl0, +bl, +ml, +fl, +ll, c2, -il]).
[] :: ([=c2, +cl, +ul0, +sl1, +gl, +nl0, +rl0, c2, -cl]).
[] :: ([=c3, +ul, +sl0, +vl, c3, -ul]).
[] :: ([=c2, +rl0, +bl, +ml, +ll, c2, -rl0]).
[] :: ([=c2, +jl, +el, +dl, +gl, +nl0, +rl0, +bl, +ml, +fl, +ll, c2, -jl]).
[] :: ([=c2, +kl, +il, +jl, +el, +dl, +gl, +nl0, +rl0, +bl, +ml, +fl, +ll, c2, -kl]).
[] :: ([=c2, +bl, +ml, +ll, c2, -bl]).
[] :: ([=c2, +dl, +gl, +nl0, +rl0, +bl, +ml, +ll, c2, -dl]).
[] :: ([=c2, +gl, +nl0, +rl0, +bl, +ml, +ll, c2, -gl]).
[] :: ([=c2, +ul0, +sl1, +kl, +il, +jl, +el, +dl, +gl, +nl0, +rl0, +bl, +ml, +fl, +ll, c2, -ul0]).
[] :: ([=c3, +vl, +nl, +rl, c3, -vl]).
[] :: ([=c2, +il, +el, +dl, +gl, +nl0, +rl0, +bl, +ml, +fl, +ll, c2, -il]).
[] :: ([=c2, +bl, +ml, +fl, c2, -bl]).
[] :: ([=c2, +il, +jl, +gl, +nl0, +rl0, +ml, +ll, c2, -il]).
[] :: ([=c2, +ql, +ul0, +sl1, +kl, +il, +jl, +gl, +nl0, +rl0, +ml, +ll, c2, -ql]).
[] :: ([=c1, +al, +tl, +dl0, c1, -al]).
[] :: ([=c2, +ml, +fl, c2, -ml]).
[] :: ([=c2, +jl, +el, +dl, +gl, +nl0, +rl0, +bl, +ml, +ll, c2, -jl]).
[] :: ([=c2, +ml, +fl, +ll, c2, -ml]).
[] :: ([=c2, +ul0, +sl1, +kl, +jl, +dl, +gl, +nl0, +rl0, +bl, +ml, +fl, +ll, c2, -ul0]).
[] :: ([=c2, +sl1, +kl, +il, +jl, +el, +dl, +gl, +nl0, +rl0, +bl, +ml, +fl, +ll, c2, -sl1]).
[] :: ([=c2, +nl0, +rl0, +bl, +ml, +fl, +ll, c2, -nl0]).
[] :: ([=c2, +il, +jl, +el, +dl, +gl, +nl0, +rl0, +bl, +ml, +ll, c2, -il]).
[] :: ([=c2, +kl, +jl, +dl, +gl, +nl0, +rl0, +bl, +ml, +fl, c2, -kl]).
[] :: ([=c2, +el, +dl, +gl, +nl0, +rl0, +bl, +ml, +ll, c2, -el]).
[] :: ([=c2, +ul0, +sl1, +kl, +jl, +dl, +gl, +nl0, +rl0, +bl, +ml, +fl, c2, -ul0]).
[] :: ([=c1, +tl, +dl0, c1, -tl]).
[] :: ([=c2, +nl0, +rl0, +bl, +ml, +fl, c2, -nl0]).
[] :: ([=c2, +sl1, +kl, +il, +jl, +gl, +nl0, +rl0, +ml, +ll, c2, -sl1]).
[] :: ([=c2, +sl1, +kl, +jl, +dl, +gl, +nl0, +rl0, +bl, +ml, +fl, c2, -sl1]).
[] :: ([=c2, +ul0, +sl1, +kl, +il, +jl, +gl, +nl0, +rl0, +ml, +ll, c2, -ul0]).
[] :: ([=c2, +rl0, +bl, +ml, +fl, +ll, c2, -rl0]).
[] :: ([=c2, +sl1, +gl, +nl0, +rl0, c2, -sl1]).
[] :: ([=c2, +ul0, +sl1, +gl, +nl0, +rl0, c2, -ul0]).
[] :: ([=c2, +gl, +nl0, +rl0, c2, -gl]).
[] :: ([=c2, +bl, +ml, +fl, +ll, c2, -bl]).
[] :: ([=c2, +jl, +gl, +nl0, +rl0, +ml, +ll, c2, -jl]).
[] :: ([=c2, +kl, +il, +jl, +gl, +nl0, +rl0, +ml, +ll, c2, -kl]).
[] :: ([=c2, +gl, +nl0, +rl0, +bl, +ml, +fl, +ll, c2, -gl]).
[] :: ([=c2, +sl1, +kl, +jl, +dl, +gl, +nl0, +rl0, +bl, +ml, +fl, +ll, c2, -sl1]).
[] :: ([=c2, +fl, +ll, c2, -fl]).
[] :: ([=c2, +sl1, +il, +jl, +el, +dl, +gl, +nl0, +rl0, +bl, +ml, +ll, c2, -sl1]).
[] :: ([=c2, +nl0, +rl0, +ml, +ll, c2, -nl0]).
[] :: ([=c2, +ml, +ll, c2, -ml]).
[] :: ([=c2, +ul0, +sl1, +il, +jl, +el, +dl, +gl, +nl0, +rl0, +bl, +ml, +ll, c2, -ul0]).
[] :: ([=c3, +pl, +ul, +sl0, +vl, +nl, +rl, c3, -pl]).
[] :: ([=c2, +kl, +il, +jl, +el, +dl, +gl, +nl0, +rl0, +bl, +ml, +fl, c2, -kl]).
[] :: ([=c2, +nl0, +rl0, c2, -nl0]).
[] :: ([=c2, +sl1, +kl, +il, +el, +dl, +gl, +nl0, +rl0, +bl, +ml, +fl, +ll, c2, -sl1]).
[] :: ([=c2, +dl, +gl, +nl0, +rl0, +bl, +ml, +fl, c2, -dl]).
[] :: ([=c2, +nl0, +rl0, +bl, +ml, +ll, c2, -nl0]).
[] :: ([=c2, +sl1, +kl, +il, +jl, +el, +dl, +gl, +nl0, +rl0, +bl, +ml, +fl, c2, -sl1]).
[] :: ([=c2, +kl, +jl, +dl, +gl, +nl0, +rl0, +bl, +ml, +fl, +ll, c2, -kl]).
[] :: ([=c2, +el, +dl, +gl, +nl0, +rl0, +bl, +ml, +fl, +ll, c2, -el]).
[] :: ([=c2, +jl, +dl, +gl, +nl0, +rl0, +bl, +ml, +fl, c2, -jl]).
[] :: ([=c2, +il, +jl, +el, +dl, +gl, +nl0, +rl0, +bl, +ml, +fl, c2, -il]).
[] :: ([=c2, +el, +dl, +gl, +nl0, +rl0, +bl, +ml, +fl, c2, -el]).
[] :: ([=c3, +sl0, +vl, +nl, +rl, c3, -sl0]).
[] :: ([=c2, +kl, +il, +el, +dl, +gl, +nl0, +rl0, +bl, +ml, +fl, +ll, c2, -kl]).
[] :: ([=c3, +nl, +rl, c3, -nl]).
[] :: ([=c2, +rl0, +bl, +ml, +fl, c2, -rl0]).
[] :: ([=c2, +jl, +dl, +gl, +nl0, +rl0, +bl, +ml, +fl, +ll, c2, -jl]).
[] :: ([=c2, +rl0, +ml, +ll, c2, -rl0]).
[] :: ([=c3, +sl0, +vl, c3, -sl0]).
[] :: ([=c3, +ul, +sl0, +vl, +nl, +rl, c3, -ul]).
[] :: ([=c2, +jl, +el, +dl, +gl, +nl0, +rl0, +bl, +ml, +fl, c2, -jl]).
[] :: ([=c2, +ul0, +sl1, +kl, +il, +jl, +el, +dl, +gl, +nl0, +rl0, +bl, +ml, +fl, c2, -ul0]).
