startCategory(cfin).
[] :: ([=c3, cfin]).
[abụọ] :: ([c1, -b]).
[atọ] :: ([c1, -b]).
[anọ] :: ([c1, -b]).
[ise] :: ([c1, -b]).
[isii] :: ([c1, -b]).
[asaa] :: ([c1, -b]).
[asato] :: ([c1, -b]).
[eteghiete] :: ([c1, -b]).
[iri] :: ([c2, -c, -s0]).
[] :: ([=c1, c2, -c]).
[otu] :: ([c1]).
[nnari] :: ([c3]).
[nnari_na] :: ([=c31sc, c3]).
[] :: ([=c2, +c, c3c]).
[nnari] :: ([=c21sb, c3]).
[] :: ([=c1, +b, c3b]).
[nnari] :: ([=c31s, c3]).
[na] :: ([=c31sc, =c21sb, c31s]).
[] :: ([=c1, +b, c31sb]).
[] :: ([=c2, +c, c31sc]).
[] :: ([=c2, +s0, c3]).
[iri_na] :: ([=c1, c2, -s0]).
[iri] :: ([=c21sb, c2, -s0]).
[] :: ([=c1, +b, c2b]).
[iri] :: ([=c21s, c2, -s0]).
[na] :: ([=c1, =c21sb, c21s]).
[] :: ([=c1, +b, c21sb]).
[] :: ([=c1, c3]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c2, +c, c2]).
[] :: ([=c1, +b, c1]).
[] :: ([=c2, +c, +s0, c2, -c]).
