startCategory(cfin).
[dó] :: ([c1, -a, -c, -h]).
[trí] :: ([c1, -e, -b, -c, -h]).
[] :: ([=c3, cfin]).
[aon] :: ([c1, -b, -d]).
[ceathair] :: ([c1, -b, -c, -h]).
[cúig] :: ([c1, -b, -c, -h]).
[sé] :: ([c1, -b, -c, -h]).
[seacht] :: ([c1, -b, -c, -f, -h]).
[ocht] :: ([c1, -b, -d, -f, -h]).
[naoi] :: ([c1, -b, -c, -h]).
[céad] :: ([c3]).
[céad] :: ([=c3g, c3]).
[] :: ([=c2, +g, c3g]).
[céad] :: ([=c1, +h, c3]).
[céad] :: ([=c3g, =c3h, c3]).
[] :: ([=c1, +h, c3h]).
[] :: ([=c2, +s0, c3]).
[deich] :: ([c2, -s0, -g]).
[dhéag] :: ([=c1, +a, c2, -s0]).
[déag] :: ([=c1, +b, c2, -s0]).
[fiche] :: ([c2, -s0, -g]).
[fiche_a] :: ([=c2c, c2, -s0]).
[] :: ([=c1, +c, c2c]).
[fiche_a_h] :: ([=c2d, c2, -s0]).
[] :: ([=c1, +d, c2d]).
[ocha] :: ([=c1, +e, c2, -s0]).
[ocha_a] :: ([=c2c, =c2e, c2, -s0]).
[] :: ([=c1, +e, c2e]).
[ocha_a_h] :: ([=c2d, =c2e, c2, -s0]).
[ceathracha] :: ([c2, -s0, -g]).
[ceathracha_a] :: ([=c2c, c2, -s0]).
[ceathracha_a_h] :: ([=c2d, c2, -s0]).
[caoga] :: ([c2, -s0, -g]).
[caoga_a] :: ([=c2c, c2, -s0]).
[caoga_a_h] :: ([=c2d, c2, -s0]).
[seasca] :: ([c2, -s0, -g]).
[seasca_a] :: ([=c2c, c2, -s0]).
[seasca_a_h] :: ([=c2d, c2, -s0]).
[ó] :: ([=c1, +f, c2, -s0]).
[ó_a_h] :: ([=c2d, =c2f, c2, -s0]).
[] :: ([=c1, +f, c2f]).
[ó_a] :: ([=c2c, =c2f, c2, -s0]).
[nócha] :: ([c2, -s0, -g]).
[nócha_a] :: ([=c2c, c2, -s0]).
[nócha_a_h] :: ([=c2d, c2, -s0]).
[] :: ([=c1, c3]).
[] :: ([=c1, c2, -g]).
[] :: ([=c1, +d, c1]).
[] :: ([=c1, +b, c1]).
[] :: ([=c1, +e, c1]).
[] :: ([=c1, +c, c1]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c2, +g, c2]).
[] :: ([=c1, +f, c1]).
[] :: ([=c1, +h, c1]).
[] :: ([=c1, +a, c1]).
[] :: ([=c1, +f, +h, c1, -f]).
[] :: ([=c1, +a, +c, +h, c1, -a]).
[] :: ([=c1, +d, +f, +h, c1, -d]).
[] :: ([=c1, +b, +d, +f, +h, c1, -b]).
[] :: ([=c2, +s0, +g, c2, -s0]).
[] :: ([=c1, +b, +c, +h, c1, -b]).
[] :: ([=c1, +c, +h, c1, -c]).
[] :: ([=c1, +b, +d, c1, -b]).
[] :: ([=c1, +b, +c, +f, +h, c1, -b]).
[] :: ([=c1, +c, +f, +h, c1, -c]).
[] :: ([=c1, +e, +b, +c, +h, c1, -e]).
