startCategory(cfin).
[] :: ([=c3, cfin]).
[nɩɩnʋwa] :: ([c3]).
[nɩɩnʋwa_nɛ] :: ([=c3b, c3]).
[] :: ([=c2, +b, c3b]).
[mɩnʋʋ] :: ([c3]).
[] :: ([=c2, +s0, c3]).
[hiu] :: ([c2, -s0, -b]).
[hiu_nɛ] :: ([=c1, c2, -s0]).
[nɛɛlɛ] :: ([c2, -s0, -b]).
[nɛɛlɛ_nɛ] :: ([=c1, c2, -s0]).
[niidozo] :: ([c2, -s0, -b]).
[niidozo_nɛ] :: ([=c1, c2, -s0]).
[nɩɩnaza] :: ([c2, -s0, -b]).
[nɩɩnaza_nɛ] :: ([=c1, c2, -s0]).
[] :: ([=c1, c3]).
[kʋɖʋm] :: ([c1]).
[naalɛ] :: ([c1]).
[naadozo] :: ([c1]).
[naanaza] :: ([c1]).
[kagbanzɩ] :: ([c1]).
[loɖo] :: ([c1]).
[lʋbɛ] :: ([c1]).
[lutozo] :: ([c1]).
[nakʋ] :: ([c1]).
[] :: ([=c1, c2, -b]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c2, +b, c2]).
[] :: ([=c2, +s0, +b, c2, -s0]).
