startCategory(cfin).
[] :: ([=c3, cfin]).
[он] :: ([c2, -b, -s0]).
[жиырма] :: ([c2, -b, -s0]).
[отыз] :: ([c2, -b, -s0]).
[қырық] :: ([c2, -b, -s0]).
[елу] :: ([c2, -b, -s0]).
[алпыс] :: ([c2, -b, -s0]).
[жетпіс] :: ([c2, -b, -s0]).
[сексен] :: ([c2, -b, -s0]).
[тоқсан] :: ([c2, -b, -s0]).
[] :: ([=c1, c2, -b]).
[бір] :: ([c1]).
[екі] :: ([c1, -c]).
[үш] :: ([c1, -c]).
[төрт] :: ([c1, -c]).
[бес] :: ([c1, -c]).
[алты] :: ([c1, -c]).
[жеті] :: ([c1, -c]).
[сегіз] :: ([c1, -c]).
[тоғыз] :: ([c1, -c]).
[жүз] :: ([c3]).
[жүз] :: ([=c3b, c3]).
[] :: ([=c2, +b, c3b]).
[жүз] :: ([=c1, +c, c3]).
[жүз] :: ([=c3b, =c3c, c3]).
[] :: ([=c1, +c, c3c]).
[] :: ([=c2, +s0, c3]).
[он] :: ([=c1, c2, -s0]).
[жиырма] :: ([=c1, c2, -s0]).
[отыз] :: ([=c1, c2, -s0]).
[қырық] :: ([=c1, c2, -s0]).
[елу] :: ([=c1, c2, -s0]).
[алпыс] :: ([=c1, c2, -s0]).
[жетпіс] :: ([=c1, c2, -s0]).
[сексен] :: ([=c1, c2, -s0]).
[тоқсан] :: ([=c1, c2, -s0]).
[] :: ([=c1, c3]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c2, +b, c2]).
[] :: ([=c1, +c, c1]).
[] :: ([=c2, +b, +s0, c2, -b]).
