startCategory(cfin).
[] :: ([=c3, cfin]).
[zóólè] :: ([c1, -b]).
[tátù] :: ([c1, -b]).
[yíyà] :: ([c1, -b]).
[táánù] :: ([c1, -b]).
[sàmbánù] :: ([c1, -b]).
[nsàmbwáádì] :: ([c1, -b]).
[náánà] :: ([c1, -b]).
[yívwà] :: ([c1, -b]).
[kúúmì] :: ([c2, -c, -s0]).
[] :: ([=c1, c2, -c]).
[mósì] :: ([c1]).
[nkámà] :: ([=c1, c3]).
[nkámà] :: ([=c31s, c3]).
[nà] :: ([=c31sc, =c1, c31s]).
[] :: ([=c2, +c, c31sc]).
[] :: ([=c2, +s0, c3]).
[kúúmì_nà] :: ([=c1, c2, -s0]).
[màkúúmì] :: ([=c21sb, c2, -s0]).
[] :: ([=c1, +b, c2b]).
[màkúúmì] :: ([=c21s, c2, -s0]).
[nà] :: ([=c1, =c21sb, c21s]).
[] :: ([=c1, +b, c21sb]).
[] :: ([=c1, c3]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c2, +c, c2]).
[] :: ([=c1, +b, c1]).
[] :: ([=c2, +c, +s0, c2, -c]).
