startCategory(cfin).
[] :: ([=c3, cfin]).
[ʔúpən] :: ([c2, -b, -s0]).
[nəc̕xʷk̕ʷə́s] :: ([c2, -b, -s0]).
[ɬxʷɬšáʔ] :: ([c2, -b, -s0]).
[ŋəsɬšáʔ] :: ([c2, -b, -s0]).
[ɬq̕čšɬšáʔ] :: ([c2, -b, -s0]).
[t̕x̣əŋɬšáʔ] :: ([c2, -b, -s0]).
[c̕aʔkʷsɬšáʔ] :: ([c2, -b, -s0]).
[taʔcsɬšáʔ] :: ([c2, -b, -s0]).
[təkʷxʷɬšáʔ] :: ([c2, -b, -s0]).
[] :: ([=c1, c2, -b]).
[nə́c̕uʔ] :: ([c1]).
[čə́saʔ] :: ([c1, -c]).
[ɬíxʷ] :: ([c1, -c]).
[ŋús] :: ([c1, -c]).
[ɬq̕áčš] :: ([c1, -c]).
[t̕x̣ə́ŋ] :: ([c1, -c]).
[c̕úʔkʷs] :: ([c1, -c]).
[táʔcs] :: ([c1, -c]).
[tə́kʷxʷ] :: ([c1, -c]).
[snáč̕əwəč] :: ([c3]).
[snáč̕əwəč_ʔiʔ] :: ([=c3b, c3]).
[] :: ([=c2, +b, c3b]).
[snáč̕əwəč] :: ([=c1, +c, c3]).
[snáč̕əwəč_ʔiʔ] :: ([=c3b, =c3c, c3]).
[] :: ([=c1, +c, c3c]).
[] :: ([=c2, +s0, c3]).
[ʔúpən_ʔiʔ] :: ([=c1, c2, -s0]).
[nəc̕xʷk̕ʷə́s_ʔiʔ] :: ([=c1, c2, -s0]).
[ɬxʷɬšáʔ_ʔiʔ] :: ([=c1, c2, -s0]).
[ŋəsɬšáʔ_ʔiʔ] :: ([=c1, c2, -s0]).
[ɬq̕čšɬšáʔ_ʔiʔ] :: ([=c1, c2, -s0]).
[t̕x̣əŋɬšáʔ_ʔiʔ] :: ([=c1, c2, -s0]).
[c̕aʔkʷsɬšáʔ_ʔiʔ] :: ([=c1, c2, -s0]).
[taʔcsɬšáʔ_ʔiʔ] :: ([=c1, c2, -s0]).
[təkʷxʷɬšáʔ_ʔiʔ] :: ([=c1, c2, -s0]).
[] :: ([=c1, c3]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c2, +b, c2]).
[] :: ([=c1, +c, c1]).
[] :: ([=c2, +b, +s0, c2, -b]).
