startCategory(cfin).
[ಒಂದು] :: ([c1, -j, -b, -m0, -d]).
[ಮೂರು] :: ([c1, -h, -b, -e, -a, -g]).
[ನಾಲ್ಕು] :: ([c1, -i, -b, -e, -a, -g]).
[ಆರು] :: ([c1, -p, -c, -f]).
[] :: ([=c3, cfin]).
[ಎರಡು] :: ([c1, -b, -d, -g]).
[ಐದು] :: ([c1, -b, -e]).
[ಏಳು] :: ([c1, -c, -m0, -f]).
[ಎಂಟು] :: ([c1, -c, -f]).
[ಒಂಬತ್ತು] :: ([c1, -c, -e]).
[ಹತ್ತು] :: ([c2, -m, -s0, -l]).
[ಹದಿನೇಳು] :: ([c2, -m, -s0, -l]).
[ಇಪ್ಪತ್ತು] :: ([c2, -m, -s0, -l]).
[] :: ([=c1, +m0, c2, -m]).
[ನೂರ_ಹದಿ] :: ([=c2a, =c3j, c3]).
[] :: ([=c1, +j, c3j]).
[] :: ([=c1, +a, c3a]).
[ನೂರ_ಇಪ್ಪತ್ತು] :: ([=c1, +j, c3]).
[ನೂರ_ಇಪ್ಪತ್ತ್] :: ([=c2b, =c3j, c3]).
[] :: ([=c1, +b, c3b]).
[ನೂರ_ಇಪ್ಪತ್ತ್] :: ([=c2c, =c3j, c3]).
[] :: ([=c1, +c, c3c]).
[ನೂರು] :: ([=cnix, =c1, c3]).
[] :: ([cnix]).
[ನೂರ] :: ([=c3l, =c1, c3]).
[] :: ([=c2, +l, c3l]).
[ನೂರ_ಮೂವತ್ತ್] :: ([=c2d, =c1, c3]).
[] :: ([=c1, +d, c3d]).
[ನೂರ_ಮೂವತ್ತ್] :: ([=c2e, =c1, c3]).
[] :: ([=c1, +e, c3e]).
[ನೂರ_ಮೂವತ್] :: ([=c2f, =c1, c3]).
[] :: ([=c1, +f, c3f]).
[ನೂರ_ನಲವತ್ತ್] :: ([=c2g, =c1, c3]).
[] :: ([=c1, +g, c3g]).
[ನೂರ_ಐವತ್ತು] :: ([=cnix, =c1, c3]).
[ನೂರ_ಐವತ್ತ] :: ([=c2h, =c1, c3]).
[] :: ([=c1, +h, c3h]).
[ನೂರ_ಐವತ್ತ್] :: ([=c2i, =c1, c3]).
[] :: ([=c1, +i, c3i]).
[ನೂರ_ಅರವತ್ತ್] :: ([=c2a, =c1, c3]).
[ನೂರ_ಎಪ್ಪತ್ತ್] :: ([=c2a, =c1, c3]).
[ನೂರ_ಎಂಬತ್ತ್] :: ([=c2a, =c1, c3]).
[ನೂರ_ತೊಂಬತ್ತ] :: ([=c2a, =c1, c3]).
[] :: ([=c2, +s0, c3]).
[ಹನ್ನೊಂದು] :: ([c2, -s0, -l]).
[ಹನ್ನೆರಡು] :: ([c2, -s0, -l]).
[ಹದಿ] :: ([=c2a, c2, -s0]).
[] :: ([=c1, +a, c2a]).
[ಹದಿನೈದು] :: ([c2, -s0, -l]).
[ಹದಿನಾರು] :: ([c2, -s0, -l]).
[ಹದಿನೆಂಟು] :: ([c2, -s0, -l]).
[ಹತ್ತೊಂಬತ್ತು] :: ([c2, -s0, -l]).
[ಇಪ್ಪತ್ತ್] :: ([=c2b, c2, -s0]).
[] :: ([=c1, +b, c2b]).
[ಇಪ್ಪತ್ತ್] :: ([=c2c, c2, -s0]).
[] :: ([=c1, +c, c2c]).
[ಮೂವತ್ತು] :: ([c2, -s0, -l]).
[ಮೂವತ್ತ್] :: ([=c2d, c2, -s0]).
[] :: ([=c1, +d, c2d]).
[ಮೂವತ್ತ್] :: ([=c2e, c2, -s0]).
[] :: ([=c1, +e, c2e]).
[ಮೂವತ್] :: ([=c2f, c2, -s0]).
[] :: ([=c1, +f, c2f]).
[ನಲವತ್ತು] :: ([c2, -s0, -l]).
[ನಲವತ್ತೊಂದು] :: ([c2, -s0, -l]).
[ನಲವತ್ತ್] :: ([=c2g, c2, -s0]).
[] :: ([=c1, +g, c2g]).
[ನಲವತ್ತೈದು] :: ([c2, -s0, -l]).
[ನಲವತ್ತಾರು] :: ([c2, -s0, -l]).
[ನಲವತ್ತೇಳು] :: ([c2, -s0, -l]).
[ನಲವತ್ತೆಂಟು] :: ([c2, -s0, -l]).
[ನಲವತ್ತೊಂಬತ್ತು] :: ([c2, -s0, -l]).
[ಐವತ್ತು] :: ([c2, -s0]).
[ಐವತ್ತೊಂದು] :: ([c2, -s0, -l]).
[ಐವತ್ತೆರಡು] :: ([c2, -s0, -l]).
[ಐವತ್ತ] :: ([=c2h, c2, -s0]).
[] :: ([=c1, +h, c2h]).
[ಐವತ್ತ್] :: ([=c2i, c2, -s0]).
[] :: ([=c1, +i, c2i]).
[ಐವತ್ತೈದು] :: ([c2, -s0, -l]).
[ಐವತ್ತಾರು] :: ([c2, -s0, -l]).
[ಐವತ್ತೇಳು] :: ([c2, -s0, -l]).
[ಐವತ್ತೆಂಟು] :: ([c2, -s0, -l]).
[ಐವತ್ತೊಂಬತ್ತು] :: ([c2, -s0, -l]).
[ಅರವತ್ತು] :: ([c2, -s0, -l]).
[ಅರವತ್ತೊಂದು] :: ([c2, -s0, -l]).
[ಅರವತ್ತೆರಡು] :: ([c2, -s0, -l]).
[ಅರವತ್ತ್] :: ([=c2a, c2, -s0]).
[ಅರವತ್ತೈದು] :: ([c2, -s0, -l]).
[ಅರವತ್ತಾರು] :: ([c2, -s0, -l]).
[ಅರವತ್ತೇಳು] :: ([c2, -s0, -l]).
[ಅರವತ್ತೆಂಟು] :: ([c2, -s0, -l]).
[ಅರವತ್ತೊಂಬತ್ತು] :: ([c2, -s0, -l]).
[ಎಪ್ಪತ್ತು] :: ([c2, -s0, -l]).
[ಎಪ್ಪತ್ತೊಂದು] :: ([c2, -s0, -l]).
[ಎಪ್ಪತ್ತೆರಡು] :: ([c2, -s0, -l]).
[ಎಪ್ಪತ್ತ್] :: ([=c2a, c2, -s0]).
[ಎಪ್ಪತ್ತೈದು] :: ([c2, -s0, -l]).
[ಎಪ್ಪತ್ತಾರು] :: ([c2, -s0, -l]).
[ಎಪ್ಪತ್ತೇಳು] :: ([c2, -s0, -l]).
[ಎಪ್ಪತ್ತೆಂಟು] :: ([c2, -s0, -l]).
[ಎಪ್ಪತ್ತೊಂಬತ್ತು] :: ([c2, -s0, -l]).
[ಎಂಬತ್ತು] :: ([c2, -s0, -l]).
[ಎಂಬತ್ತೊಂದು] :: ([c2, -s0, -l]).
[ಎಂಬತ್ತೆರಡು] :: ([c2, -s0, -l]).
[ಎಂಬತ್ತ್] :: ([=c2a, c2, -s0]).
[ಎಂಬತ್ತೈದು] :: ([c2, -s0, -l]).
[ಎಂಬತ್ತಾರು] :: ([c2, -s0, -l]).
[ಎಂಬತ್ತೇಳು] :: ([c2, -s0, -l]).
[ಎಂಬತ್ತೆಂಟು] :: ([c2, -s0, -l]).
[ಎಂಬತ್ತೊಂಬತ್ತು] :: ([c2, -s0, -l]).
[ತೊಂಬತ್ತು] :: ([c2, -s0, -l]).
[ತೊಂಬತ್ತೊಂದು] :: ([c2, -s0, -l]).
[ತೊಂಬತ್ತೆರಡು] :: ([c2, -s0, -l]).
[ತೊಂಬತ್ತ] :: ([=c2a, c2, -s0]).
[ತೊಂಬತ್ತೈದು] :: ([c2, -s0, -l]).
[ತೊಂಬತ್ತಾರು] :: ([c2, -s0, -l]).
[ತೊಂಬತ್ತೇಳು] :: ([c2, -s0, -l]).
[ತೊಂಬತ್ತೆಂಟು] :: ([c2, -s0, -l]).
[ತೊಂಬತ್ತೊಂಬತ್ತು] :: ([c2, -s0, -l]).
[] :: ([=c1, c3]).
[] :: ([=c4, c3]).
[ಸಾವಿರ] :: ([=c2, +m, c4]).
[N_ಸಾವಿರದ] :: ([=c4p, c4]).
[] :: ([=c1, +p, c4p]).
[N_ಸಾವಿರ_Q] :: ([c4]).
[] :: ([=c1, c2, -l]).
[] :: ([=c1, +d, c1]).
[] :: ([=c1, +i, c1]).
[] :: ([=c2, +m, c2]).
[] :: ([=c1, +b, c1]).
[] :: ([=c1, +e, c1]).
[] :: ([=c1, +p, c1]).
[] :: ([=c1, +c, c1]).
[] :: ([=c1, +g, c1]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c1, +f, c1]).
[] :: ([=c1, +j, c1]).
[] :: ([=c1, +h, c1]).
[] :: ([=c1, +a, c1]).
[] :: ([=c1, +m0, c1]).
[] :: ([=c2, +l, c2]).
[] :: ([=c1, +b, +e, +a, +g, c1, -b]).
[] :: ([=c1, +c, +f, c1, -c]).
[] :: ([=c1, +c, +m0, +f, c1, -c]).
[] :: ([=c1, +i, +b, +e, +a, +g, c1, -i]).
[] :: ([=c1, +j, +b, +m0, +d, c1, -j]).
[] :: ([=c2, +s0, +l, c2, -s0]).
[] :: ([=c1, +h, +b, +e, +a, +g, c1, -h]).
[] :: ([=c1, +b, +m0, +d, c1, -b]).
[] :: ([=c1, +d, +g, c1, -d]).
[] :: ([=c1, +m0, +f, c1, -m0]).
[] :: ([=c1, +b, +d, +g, c1, -b]).
[] :: ([=c1, +p, +c, +f, c1, -p]).
[] :: ([=c1, +b, +e, c1, -b]).
[] :: ([=c2, +m, +s0, +l, c2, -m]).
[] :: ([=c1, +a, +g, c1, -a]).
[] :: ([=c1, +c, +e, c1, -c]).
[] :: ([=c1, +m0, +d, c1, -m0]).
[] :: ([=c1, +e, +a, +g, c1, -e]).
