startCategory(cfin).
[apar] :: ([c2, -d]).
[] :: ([=c3, cfin]).
[aryɔɔ] :: ([c1, -b, -c]).
[adek] :: ([c1, -b, -c]).
[aŋwɛn] :: ([c1, -b, -c]).
[abic] :: ([c1, -b, -c]).
[abicɛl] :: ([c1, -b, -c]).
[abiro] :: ([c1, -b, -c]).
[aboro] :: ([c1, -b, -c]).
[abongwɛn] :: ([c1, -b, -c]).
[mia] :: ([c3]).
[mia] :: ([=c31s, c3]).
[wiɛ] :: ([=c1, =c1, c31s]).
[mia] :: ([=c32s, c3]).
[ì] :: ([=c32sd, =c1, c32s]).
[] :: ([=c2, +d, c32sd]).
[mia] :: ([=c2c, c3]).
[] :: ([=c1, +c, c3c]).
[] :: ([=c2, c3]).
[apar_wiɛ] :: ([=c1, c2]).
[pyer] :: ([=c21s, c2]).
[wiɛ] :: ([=c1, =c21sb, c21s]).
[] :: ([=c1, +b, c21sb]).
[pyer] :: ([=c2c, c2]).
[] :: ([=c1, +c, c2c]).
[] :: ([=c1, c3]).
[acɛl] :: ([c1]).
[] :: ([=c1, +b, c1]).
[] :: ([=c1, +c, c1]).
[] :: ([=c2, +d, c2]).
[] :: ([=c1, +b, +c, c1, -b]).
