startCategory(cfin).
[] :: ([=c3, cfin]).
[míbalé] :: ([c1, -b]).
[mísáto] :: ([c1, -b]).
[mínei] :: ([c1, -b]).
[mítáno] :: ([c1, -b]).
[motóba] :: ([c1, -b]).
[sámbó] :: ([c1, -b]).
[mwámbe] :: ([c1, -b]).
[libwá] :: ([c1, -b]).
[zómi] :: ([c2, -c, -s0]).
[] :: ([=c1, c2, -c]).
[mókó] :: ([c1]).
[nkámá] :: ([c3]).
[nkámá] :: ([=c31s, c3]).
[na] :: ([=c31sc, =c1, c31s]).
[] :: ([=c2, +c, c31sc]).
[nkámá] :: ([=c21sb, c3]).
[] :: ([=c1, +b, c3b]).
[] :: ([=c2, +s0, c3]).
[zómi_na] :: ([=c1, c2, -s0]).
[ntúkú] :: ([=c21sb, c2, -s0]).
[] :: ([=c1, +b, c2b]).
[ntúkú] :: ([=c21s, c2, -s0]).
[na] :: ([=c1, =c21sb, c21s]).
[] :: ([=c1, +b, c21sb]).
[] :: ([=c1, c3]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c2, +c, c2]).
[] :: ([=c1, +b, c1]).
[] :: ([=c2, +c, +s0, c2, -c]).
