startCategory(cfin).
[] :: ([=c3, cfin]).
[kakš] :: ([c1, -b]).
[kuolm] :: ([c1, -b]).
[nēļa] :: ([c1, -b]).
[vīž] :: ([c1, -b]).
[kūž] :: ([c1, -b]).
[seis] :: ([c1, -b]).
[kōdõks] :: ([c1, -b]).
[īdõks] :: ([c1, -b]).
[kim] :: ([c2, -c, -s0]).
[] :: ([=c1, c2, -c]).
[ikš] :: ([c1]).
[sadā] :: ([c3]).
[sadā] :: ([=c3c, c3]).
[] :: ([=c2, +c, c3c]).
[saddõ] :: ([=c1, +b, c3]).
[saddõ] :: ([=c3c, =c2b, c3]).
[] :: ([=c1, +b, c3b]).
[] :: ([=c2, +s0, c3]).
[tuoistõn] :: ([=cnix, =c1, c2, -s0]).
[] :: ([cnix]).
[kimdõ] :: ([=c1, +b, c2, -s0]).
[kimdõ] :: ([=c1, =c2b, c2, -s0]).
[] :: ([=c1, +b, c2b]).
[] :: ([=c1, c3]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c2, +c, c2]).
[] :: ([=c1, +b, c1]).
[] :: ([=c2, +c, +s0, c2, -c]).
