startCategory(cfin).
[] :: ([=c3, cfin]).
[łixʷ] :: ([c1, -b]).
[buus] :: ([c1, -b]).
[saliʔ] :: ([c1, -c]).
[cəlac] :: ([c1, -c]).
[dᶻəlačiʔ] :: ([c1, -c]).
[c’ukʷs] :: ([c1, -c]).
[təqačiʔ] :: ([c1, -c]).
[x̌ʷəl] :: ([c1, -c]).
[sbək’ʷačiʔ] :: ([=cnix, =c1, c3]).
[] :: ([cnix]).
[sbək’ʷačiʔ_yəxʷ_kʷi] :: ([=c3d, =c1, c3]).
[] :: ([=c2, +d, c3d]).
[] :: ([=c2, +s0, c3]).
[padac] :: ([c2, -s0, -d]).
[padac_yəxʷ_kʷi] :: ([=c1, c2, -s0]).
[s] :: ([=c21s, c2, -s0]).
[ačiʔ] :: ([=c1, +b, c21s]).
[s] :: ([=c22s, c2, -s0]).
[ačiʔ_yəxʷ_kʷi] :: ([=c1, =c22sb, c22s]).
[] :: ([=c1, +b, c22sb]).
[ačiʔ] :: ([=c1, +c, c2, -s0]).
[ačiʔ_yəxʷ_kʷi] :: ([=c1, =c2c, c2, -s0]).
[] :: ([=c1, +c, c2c]).
[] :: ([=c1, c3]).
[dəč’uʔ] :: ([c1]).
[] :: ([=c1, c2, -d]).
[] :: ([=c2, +d, c2]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c1, +c, c1]).
[] :: ([=c1, +b, c1]).
[] :: ([=c2, +s0, +d, c2, -s0]).
