startCategory(cfin).
[три] :: ([c1, -f, -b, -a]).
[шест] :: ([c1, -h, -a]).
[] :: ([=c3, cfin]).
[два] :: ([c1, -b, -a]).
[четири] :: ([c1, -b, -a, -g]).
[еден] :: ([c1]).
[пет] :: ([c1, -a, -g]).
[седум] :: ([c1, -a, -d, -g]).
[осум] :: ([c1, -a, -d, -g]).
[девет] :: ([c1, -a, -g]).
[десет] :: ([c2, -e, -s0]).
[единаесет] :: ([c2, -e, -s0]).
[педесет] :: ([c2, -e, -s0]).
[шеесет] :: ([c2, -e, -s0]).
[деведесет] :: ([c2, -e, -s0]).
[] :: ([=c1, c2, -e]).
[сто] :: ([c3]).
[сто] :: ([=c3e, c3]).
[] :: ([=c2, +e, c3e]).
[двесте] :: ([c3]).
[двесте] :: ([=c3e, c3]).
[ста] :: ([=c1, +f, c3]).
[ста] :: ([=c3e, =c3f, c3]).
[] :: ([=c1, +f, c3f]).
[стотини] :: ([=c1, +g, c3]).
[стотини] :: ([=c3e, =c3g, c3]).
[] :: ([=c1, +g, c3g]).
[отини] :: ([=c1, +h, c3]).
[отини] :: ([=c3e, =c3h, c3]).
[] :: ([=c1, +h, c3h]).
[] :: ([=c2, +s0, c3]).
[наесет] :: ([=c1, +a, c2, -s0]).
[есет] :: ([=c1, +b, c2, -s0]).
[есет_и] :: ([=c1, =c2b, c2, -s0]).
[] :: ([=c1, +b, c2b]).
[педесет_и] :: ([=c1, c2, -s0]).
[шеесет_и] :: ([=c1, c2, -s0]).
[десет] :: ([=c1, +d, c2, -s0]).
[десет_и] :: ([=c1, =c2d, c2, -s0]).
[] :: ([=c1, +d, c2d]).
[деведесет_и] :: ([=c1, c2, -s0]).
[] :: ([=c1, c3]).
[] :: ([=c1, +d, c1]).
[] :: ([=c1, +b, c1]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c1, +g, c1]).
[] :: ([=c1, +f, c1]).
[] :: ([=c1, +h, c1]).
[] :: ([=c1, +a, c1]).
[] :: ([=c2, +e, c2]).
[] :: ([=c1, +h, +a, c1, -h]).
[] :: ([=c2, +e, +s0, c2, -e]).
[] :: ([=c1, +a, +d, +g, c1, -a]).
[] :: ([=c1, +d, +g, c1, -d]).
[] :: ([=c1, +b, +a, c1, -b]).
[] :: ([=c1, +a, +g, c1, -a]).
[] :: ([=c1, +b, +a, +g, c1, -b]).
[] :: ([=c1, +f, +b, +a, c1, -f]).
