startCategory(cfin).
[taŋ] :: ([c1, -c]).
[] :: ([=c3, cfin]).
[saba] :: ([c1, -b, -a]).
[naani] :: ([c1, -b, -a]).
[luulu] :: ([c1, -b, -a]).
[wooro] :: ([c1, -b, -a]).
[worowula] :: ([c1, -b, -a]).
[sey] :: ([c1, -b, -a]).
[keme] :: ([=c2a, c3]).
[] :: ([=c1, +a, c3a]).
[keme] :: ([=c31s, c3]).
[niŋ] :: ([=c31sd, =c2a, c31s]).
[] :: ([=c1, +a, c31sa]).
[] :: ([=c2, +d, c31sd]).
[] :: ([=c2, +s0, c3]).
[taŋ_niŋ] :: ([=c2a, c2, -s0]).
[] :: ([=c1, +a, c2a]).
[muwaŋ] :: ([c2, -s0, -d]).
[muwaŋ_niŋ] :: ([=c2a, c2, -s0]).
[taŋ] :: ([=c21sb, c2, -s0]).
[] :: ([=c1, +b, c2b]).
[taŋ] :: ([=c21s, c2, -s0]).
[niŋ] :: ([=c2a, =c21sb, c21s]).
[] :: ([=c1, +b, c21sb]).
[] :: ([=c1, +a, c21sa]).
[konoto] :: ([=c1, +c, c2, -s0]).
[konoto_niŋ] :: ([=c2a, =c2c, c2, -s0]).
[] :: ([=c1, +c, c2c]).
[] :: ([=c1, c3]).
[kiliŋ] :: ([c1, -a]).
[fula] :: ([c1, -a]).
[kononto] :: ([c1, -a]).
[] :: ([=c1, c2, -d]).
[] :: ([=c1, +b, c1]).
[] :: ([=c1, +c, c1]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c1, +a, c1]).
[] :: ([=c2, +d, c2]).
[] :: ([=c2, +s0, +d, c2, -s0]).
[] :: ([=c1, +b, +a, c1, -b]).
