startCategory(cfin).
[] :: ([=c3, cfin]).
[cew] :: ([c1, -b]).
[makar] :: ([c1, -b]).
[mǝfaɗ] :: ([c1, -b]).
[zlom] :: ([c1, -b]).
[mǝko] :: ([c1, -b]).
[sǝsǝre] :: ([c1, -b]).
[slalakar] :: ([c1, -b]).
[holombo] :: ([c1, -b]).
[kǝro] :: ([c2, -c, -s0]).
[] :: ([=c1, c2, -c]).
[bǝlen] :: ([c1]).
[sǝkat] :: ([c3]).
[sǝkat_nǝ] :: ([=c31sc, c3]).
[] :: ([=c2, +c, c3c]).
[sǝkat] :: ([=c21sb, c3]).
[] :: ([=c1, +b, c3b]).
[sǝkat] :: ([=c31s, c3]).
[nǝ] :: ([=c31sc, =c21sb, c31s]).
[] :: ([=c1, +b, c31sb]).
[] :: ([=c2, +c, c31sc]).
[] :: ([=c2, +s0, c3]).
[kǝro_hǝr] :: ([=c1, c2, -s0]).
[kokǝr] :: ([=c21sb, c2, -s0]).
[] :: ([=c1, +b, c2b]).
[kokǝr] :: ([=c21s, c2, -s0]).
[hǝr] :: ([=c1, =c21sb, c21s]).
[] :: ([=c1, +b, c21sb]).
[] :: ([=c1, c3]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c2, +c, c2]).
[] :: ([=c1, +b, c1]).
[] :: ([=c2, +c, +s0, c2, -c]).
