startCategory(cfin).
[] :: ([=c3, cfin]).
[caa_kârâ_î-jè] :: ([c2, -b, -s0]).
[] :: ([=c1, c2, -b]).
[caapwi] :: ([c1]).
[êrêilû] :: ([c1]).
[êrêcié] :: ([c1]).
[êrêpëpé] :: ([c1]).
[du_î-jè] :: ([c2, -c, -s0]).
[du_î-jè_â_jè_â-jè] :: ([c2, -c, -s0]).
[âboro] :: ([=c2, +b, c3]).
[âboro_görö] :: ([=c1, =c1, c3]).
[âboro_â_jè_î-jè] :: ([=cnix, =c1, c3]).
[] :: ([cnix]).
[âboro_â_jè_î-jè_görö] :: ([=c1, =c1, c3]).
[âboro_â] :: ([=c3c, =c1, c3]).
[] :: ([=c2, +c, c3c]).
[] :: ([=c2, +s0, c3]).
[caa_kârâ_î-jè_görö] :: ([=c1, c2, -s0]).
[du_î-jè_görö] :: ([=c1, c2, -s0]).
[du_î-jè_â_jè_â-jè_görö] :: ([=c1, c2, -s0]).
[] :: ([=c1, c3]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c2, +c, c2]).
[] :: ([=c2, +b, c2]).
[] :: ([=c2, +c, +s0, c2, -c]).
[] :: ([=c2, +b, +s0, c2, -b]).
