startCategory(cfin).
[määjtsk] :: ([c1, -a, -g0]).
[taxk] :: ([c2, -d, -e, -s0, -h, -g]).
[maajk] :: ([c2, -f, -e, -s0]).
[] :: ([=c3, cfin]).
[tu’uk] :: ([c1, -b]).
[tëkëëk] :: ([c1, -b]).
[mëkooxk] :: ([c2, -e, -s0, -h, -g]).
[tëtuujk] :: ([c2, -e, -s0, -h, -g]).
[wxtuujk] :: ([c2, -e, -s0, -h, -g]).
[tuktuujk] :: ([c2, -e, -s0, -h, -g]).
[taxtuujk] :: ([c2, -e, -s0, -h, -g]).
[] :: ([=c1, c2, -e]).
[mamaajks] :: ([c3]).
[mamokx] :: ([c3]).
[mamokx] :: ([=c1, c3]).
[mamokxma] :: ([=c3d, c3]).
[] :: ([=c2, +d, c3d]).
[i’px] :: ([c3]).
[i’px] :: ([=c3e, c3]).
[] :: ([=c2, +e, c3e]).
[i’px] :: ([=c31s, c3]).
[] :: ([=c33sg, =c33sf, c31s]).
[] :: ([=c2, +f, c31sf]).
[] :: ([=c2, +g, c31sg]).
[wxiikx] :: ([c3]).
[wxiikx] :: ([=c3h, c3]).
[] :: ([=c2, +h, c3h]).
[wxiikxmyaajk] :: ([c3]).
[wxiikxmyaajk] :: ([=c3h, c3]).
[tëkë’px] :: ([c3]).
[tëkë’px] :: ([=c3e, c3]).
[tëkë’px] :: ([=c32s, c3]).
[] :: ([=c33sg, =c33sf, c32s]).
[] :: ([=c2, +f, c32sf]).
[] :: ([=c2, +g, c32sg]).
[mata’px] :: ([c3]).
[mata’px] :: ([=c3e, c3]).
[mata’px] :: ([=c33s, c3]).
[] :: ([=c33sg, =c33sf, c33s]).
[] :: ([=c2, +f, c33sf]).
[] :: ([=c2, +g, c33sg]).
[mëko’px] :: ([c3]).
[] :: ([=c2, +s0, c3]).
[ma] :: ([=c2a, c2, -s0]).
[] :: ([=c1, +a, c2a]).
[maajk] :: ([=c2b, c2, -s0]).
[] :: ([=c1, +b, c2b]).
[] :: ([=c1, c3]).
[] :: ([=c1, c2, -h]).
[] :: ([=c1, +g0, c2, -g]).
[] :: ([=c1, +g0, c1]).
[] :: ([=c2, +f, c2]).
[] :: ([=c1, +b, c1]).
[] :: ([=c2, +h, c2]).
[] :: ([=c2, +g, c2]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c1, +a, c1]).
[] :: ([=c2, +d, c2]).
[] :: ([=c2, +e, c2]).
[] :: ([=c2, +e, +s0, c2, -e]).
[] :: ([=c2, +f, +e, +s0, c2, -f]).
[] :: ([=c2, +h, +g, c2, -h]).
[] :: ([=c2, +e, +s0, +h, +g, c2, -e]).
[] :: ([=c2, +s0, +h, +g, c2, -s0]).
[] :: ([=c2, +d, +e, +s0, +h, +g, c2, -d]).
[] :: ([=c1, +a, +g0, c1, -a]).
