startCategory(cfin).
[две] :: ([c1, -f, -a]).
[три] :: ([c1, -c, -a, -g]).
[] :: ([=c3, cfin]).
[один] :: ([c1, -a]).
[четыре] :: ([c1, -g]).
[пять] :: ([c1, -d, -h]).
[шесть] :: ([c1, -d, -h]).
[семь] :: ([c1, -d, -h]).
[восемь] :: ([c1, -d, -h]).
[девять] :: ([c1, -h]).
[десять] :: ([c2, -e, -s0]).
[четырнадцать] :: ([c2, -e, -s0]).
[пятнадцать] :: ([c2, -e, -s0]).
[шестнадцать] :: ([c2, -e, -s0]).
[семнадцать] :: ([c2, -e, -s0]).
[восемнадцать] :: ([c2, -e, -s0]).
[девятнадцать] :: ([c2, -e, -s0]).
[двадцать] :: ([c2, -e, -s0]).
[сорок] :: ([c2, -e, -s0]).
[девяносто] :: ([c2, -e, -s0]).
[] :: ([=c1, c2, -e]).
[сто] :: ([c3]).
[сто] :: ([=c3e, c3]).
[] :: ([=c2, +e, c3e]).
[сти] :: ([=c1, +f, c3]).
[сти] :: ([=c3e, =c3f, c3]).
[] :: ([=c1, +f, c3f]).
[ста] :: ([=c1, +g, c3]).
[ста] :: ([=c3e, =c3g, c3]).
[] :: ([=c1, +g, c3g]).
[сот] :: ([=c1, +h, c3]).
[сот] :: ([=c3e, =c3h, c3]).
[] :: ([=c1, +h, c3h]).
[] :: ([=c2, +s0, c3]).
[надцать] :: ([=c1, +a, c2, -s0]).
[двадцать] :: ([=c1, c2, -s0]).
[дцать] :: ([=c1, +c, c2, -s0]).
[дцать] :: ([=c1, =c2c, c2, -s0]).
[] :: ([=c1, +c, c2c]).
[сорок] :: ([=c1, c2, -s0]).
[десят] :: ([=c1, +d, c2, -s0]).
[десят] :: ([=c1, =c2d, c2, -s0]).
[] :: ([=c1, +d, c2d]).
[девяносто] :: ([=c1, c2, -s0]).
[] :: ([=c1, c3]).
[] :: ([=c1, +d, c1]).
[] :: ([=c1, +c, c1]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c1, +g, c1]).
[] :: ([=c1, +f, c1]).
[] :: ([=c1, +h, c1]).
[] :: ([=c1, +a, c1]).
[] :: ([=c2, +e, c2]).
[] :: ([=c2, +e, +s0, c2, -e]).
[] :: ([=c1, +d, +h, c1, -d]).
[] :: ([=c1, +f, +a, c1, -f]).
[] :: ([=c1, +a, +g, c1, -a]).
[] :: ([=c1, +c, +a, +g, c1, -c]).
