startCategory(cfin).
[] :: ([=c3, cfin]).
[ʔapən] :: ([c2, -b, -s0]).
[t̕θaxʷkʷəs] :: ([c2, -b, -s0]).
[ɬəxʷɬšeʔ] :: ([c2, -b, -s0]).
[ŋəsɬšeʔ] :: ([c2, -b, -s0]).
[ɬq̕əčsɬšeʔ] :: ([c2, -b, -s0]).
[t̕x̣əməɬšeʔ] :: ([c2, -b, -s0]).
[t̕θəʔkʷsɬšeʔ] :: ([c2, -b, -s0]).
[štəmaʔəs] :: ([c2, -b, -s0]).
[təkʷxʷəɬšeʔ] :: ([c2, -b, -s0]).
[] :: ([=c1, c2, -b]).
[nət̕θəʔ] :: ([c1]).
[čəsəʔ] :: ([c1, -c]).
[ɬixʷ] :: ([c1, -c]).
[ŋas] :: ([c1, -c]).
[ɬq̕ečəs] :: ([c1, -c]).
[t̕x̣əŋ] :: ([c1, -c]).
[t̕θaʔkʷəs] :: ([c1, -c]).
[teʔθəs] :: ([c1, -c]).
[təkʷəxʷ] :: ([c1, -c]).
[sneč̕əw̕əč] :: ([c3]).
[sneč̕əw̕əč_ʔiʔ_kʷs] :: ([=c3b, c3]).
[] :: ([=c2, +b, c3b]).
[sneč̕əw̕əč] :: ([=c1, +c, c3]).
[sneč̕əw̕əč_ʔiʔ_kʷs] :: ([=c3b, =c3c, c3]).
[] :: ([=c1, +c, c3c]).
[] :: ([=c2, +s0, c3]).
[ʔapən_ʔiʔ_kʷs] :: ([=c1, c2, -s0]).
[t̕θaxʷkʷəs_ʔiʔ_kʷs] :: ([=c1, c2, -s0]).
[ɬəxʷɬšeʔ_ʔiʔ_kʷs] :: ([=c1, c2, -s0]).
[ŋəsɬšeʔ_ʔiʔ_kʷs] :: ([=c1, c2, -s0]).
[ɬq̕əčsɬšeʔ_ʔiʔ_kʷs] :: ([=c1, c2, -s0]).
[t̕x̣əməɬšeʔ_ʔiʔ_kʷs] :: ([=c1, c2, -s0]).
[t̕θəʔkʷsɬšeʔ_ʔiʔ_kʷs] :: ([=c1, c2, -s0]).
[štəmaʔəs_ʔiʔ_kʷs] :: ([=c1, c2, -s0]).
[təkʷxʷəɬšeʔ_ʔiʔ_kʷs] :: ([=c1, c2, -s0]).
[] :: ([=c1, c3]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c2, +b, c2]).
[] :: ([=c1, +c, c1]).
[] :: ([=c2, +b, +s0, c2, -b]).
