startCategory(cfin).
[један] :: ([c1, -a]).
[два] :: ([c1, -f, -b, -c]).
[три] :: ([c1, -g, -b, -c]).
[] :: ([=c3, cfin]).
[пет] :: ([c1, -b, -h]).
[седам] :: ([c1, -b, -c, -h]).
[осам] :: ([c1, -b, -c, -h]).
[девет] :: ([c1, -b, -h]).
[десет] :: ([c2, -e, -s0]).
[четрнаест] :: ([c2, -e, -s0]).
[шеснаест] :: ([c2, -e, -s0]).
[четрдесет] :: ([c2, -e, -s0]).
[педесет] :: ([c2, -e, -s0]).
[шездесет] :: ([c2, -e, -s0]).
[деведесет] :: ([c2, -e, -s0]).
[] :: ([=c1, c2, -e]).
[четири] :: ([c1, -h]).
[шест] :: ([c1, -h]).
[сто] :: ([c3]).
[сто] :: ([=c3e, c3]).
[] :: ([=c2, +e, c3e]).
[сто] :: ([=c1, +f, c3]).
[сто] :: ([=c3e, =c3f, c3]).
[] :: ([=c1, +f, c3f]).
[ста] :: ([=c1, +g, c3]).
[ста] :: ([=c3e, =c3g, c3]).
[] :: ([=c1, +g, c3g]).
[сто] :: ([=c1, +h, c3]).
[сто] :: ([=c3e, =c3h, c3]).
[] :: ([=c1, +h, c3h]).
[] :: ([=c2, +s0, c3]).
[аест] :: ([=c1, +a, c2, -s0]).
[наест] :: ([=c1, +b, c2, -s0]).
[десет] :: ([=c1, +c, c2, -s0]).
[десет_и] :: ([=c1, =c2c, c2, -s0]).
[] :: ([=c1, +c, c2c]).
[четрдесет_и] :: ([=c1, c2, -s0]).
[педесет_и] :: ([=c1, c2, -s0]).
[шездесет_и] :: ([=c1, c2, -s0]).
[деведесет_и] :: ([=c1, c2, -s0]).
[] :: ([=c1, c3]).
[] :: ([=c1, +c, c1]).
[] :: ([=c1, +b, c1]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c1, +g, c1]).
[] :: ([=c1, +f, c1]).
[] :: ([=c1, +h, c1]).
[] :: ([=c1, +a, c1]).
[] :: ([=c2, +e, c2]).
[] :: ([=c2, +e, +s0, c2, -e]).
[] :: ([=c1, +g, +b, +c, c1, -g]).
[] :: ([=c1, +f, +b, +c, c1, -f]).
[] :: ([=c1, +b, +c, +h, c1, -b]).
[] :: ([=c1, +c, +h, c1, -c]).
[] :: ([=c1, +b, +c, c1, -b]).
[] :: ([=c1, +b, +h, c1, -b]).
