startCategory(cfin).
[n’da] :: ([c1, -e, -k]).
[goho] :: ([c1, -h, -b, -a, -d, -k]).
[] :: ([=c4, cfin]).
[yoho] :: ([c1, -b, -a, -d]).
[hyu] :: ([c1, -b, -a, -d, -k]).
[ku̱t’a] :: ([c1, -b, -d, -k]).
[’dato] :: ([c1, -b, -k]).
[yoto] :: ([c1, -b, -a, -d, -k]).
[hyäto] :: ([c1, -b, -a, -k]).
[gu̱to] :: ([c1, -b, -a, -d, -k]).
[de̱’ma’da] :: ([c2, -j, -c]).
[de̱’maku̱t’a] :: ([c2, -j, -c]).
[de̱’ma’dato] :: ([c2, -j, -c]).
[de̱t’a] :: ([c2, -c, -i0]).
[yo_syento] :: ([c4]).
[yo_syento_’ne] :: ([=c4i, c4]).
[] :: ([=c3, +i, c4i]).
[yo_syento_’ne_’] :: ([=c4j, c4]).
[] :: ([=c2, +j, c4j]).
[syento] :: ([=c1, +k, c4]).
[syento_’ne] :: ([=c4i, =c4k, c4]).
[] :: ([=c1, +k, c4k]).
[syento_’ne_’] :: ([=c4j, =c4k, c4]).
[] :: ([=c3, +s0, c4]).
[’da̱te] :: ([c3, -s0, -i]).
[’da̱tema’da] :: ([c3, -s0, -i]).
[’da̱tema] :: ([=c3b, c3, -s0]).
[] :: ([=c1, +b, c3b]).
[’da̱tema’] :: ([=c3c, c3, -s0]).
[] :: ([=c2, +c, c3c]).
[yote‘] :: ([c3, -s0, -i]).
[yotema’da] :: ([c3, -s0, -i]).
[yotema] :: ([=c3d, c3, -s0]).
[] :: ([=c1, +d, c3d]).
[yotema’dato] :: ([c3, -s0, -i]).
[yotemahyäto] :: ([c3, -s0, -i]).
[yotema’de̱’a] :: ([c3, -s0, -i]).
[yotema’de̱’a] :: ([=c3e, c3, -s0]).
[] :: ([=c1, +e, c3e]).
[yotema’de̱’ma] :: ([=c3b, c3, -s0]).
[hyäte] :: ([c3, -s0, -i]).
[hyäte] :: ([=c3e, c3, -s0]).
[hyätema] :: ([=c3b, c3, -s0]).
[hyätema’F] :: ([c3, -s0]).
[hyätema’F] :: ([=c1, c3, -s0]).
[’da̱te] :: ([=c1, +h, c3, -s0]).
[’da̱tema’da] :: ([=c1, +h, c3, -s0]).
[’da̱tema] :: ([=c3b, =c3h, c3, -s0]).
[] :: ([=c1, +h, c3h]).
[’da̱tema’] :: ([=c3c, =c3h, c3, -s0]).
[] :: ([=c2, c4]).
[de̱’ma] :: ([=c2a, c2]).
[] :: ([=c1, +a, c2a]).
[] :: ([=c1, c4]).
[] :: ([=c2, +i0, c3, -i]).
[] :: ([=c1, c3, -i]).
[] :: ([=c1, +d, c1]).
[] :: ([=c2, +c, c2]).
[] :: ([=c1, +b, c1]).
[] :: ([=c1, +e, c1]).
[] :: ([=c2, +j, c2]).
[] :: ([=c1, +k, c1]).
[] :: ([=c3, +i, c3]).
[] :: ([=c1, +h, c1]).
[] :: ([=c1, +a, c1]).
[] :: ([=c3, +s0, c3]).
[] :: ([=c2, +i0, c2]).
[] :: ([=c1, +b, +d, +k, c1, -b]).
[] :: ([=c1, +b, +a, +d, +k, c1, -b]).
[] :: ([=c2, +c, +i0, c2, -c]).
[] :: ([=c1, +b, +k, c1, -b]).
[] :: ([=c1, +b, +a, +k, c1, -b]).
[] :: ([=c1, +h, +b, +a, +d, +k, c1, -h]).
[] :: ([=c1, +b, +a, +d, c1, -b]).
[] :: ([=c1, +a, +k, c1, -a]).
[] :: ([=c1, +d, +k, c1, -d]).
[] :: ([=c1, +a, +d, +k, c1, -a]).
[] :: ([=c3, +s0, +i, c3, -s0]).
[] :: ([=c1, +a, +d, c1, -a]).
[] :: ([=c2, +j, +c, c2, -j]).
[] :: ([=c1, +e, +k, c1, -e]).
