startCategory(cfin).
[koumm] :: ([c1, -b, -a, -f]).
[] :: ([=c3, cfin]).
[õhtt] :: ([c1, -a]).
[kue’htt] :: ([c1]).
[nellj] :: ([c1, -a, -d, -f]).
[viit] :: ([c1, -a, -f]).
[kutt] :: ([c1, -a, -d, -f]).
[čiččâm] :: ([c1, -a, -f]).
[kääu’c] :: ([c1, -f]).
[ååu’c] :: ([c1, -f]).
[lååi] :: ([c2, -e, -s0]).
[õtmlo] :: ([c2, -e, -s0]).
[kuâtmlo] :: ([c2, -e, -s0]).
[konmlo] :: ([c2, -e, -s0]).
[nenjmlo] :: ([c2, -e, -s0]).
[vitmlo] :: ([c2, -e, -s0]).
[kutmlo] :: ([c2, -e, -s0]).
[činmlo] :: ([c2, -e, -s0]).
[käcmlo] :: ([c2, -e, -s0]).
[åcmlo] :: ([c2, -e, -s0]).
[kuâhttlo] :: ([c2, -e, -s0]).
[kuåtlõkkuå’t] :: ([c2, -e, -s0]).
[kuåtlõkkää’hhc] :: ([c2, -e, -s0]).
[kuåtlõkåå’hhc] :: ([c2, -e, -s0]).
[vittlo] :: ([c2, -e, -s0]).
[čičmlo] :: ([c2, -e, -s0]).
[kä’hcclo] :: ([c2, -e, -s0]).
[å’hcclo] :: ([c2, -e, -s0]).
[] :: ([=c1, c2, -e]).
[čua’tt] :: ([c3]).
[čua’tt] :: ([=c3e, c3]).
[] :: ([=c2, +e, c3e]).
[kuåhht_čua’tt] :: ([c3]).
[kuåhht_čua’tt] :: ([=c3e, c3]).
[čua’tt] :: ([=c1, +f, c3]).
[čua’tt] :: ([=c3e, =c3f, c3]).
[] :: ([=c1, +f, c3f]).
[] :: ([=c2, +s0, c3]).
[kuåtlõk] :: ([=c2a, c2, -s0]).
[] :: ([=c1, +a, c2a]).
[lc] :: ([=c1, +b, c2, -s0]).
[lc] :: ([=c1, =c2b, c2, -s0]).
[] :: ([=c1, +b, c2b]).
[vittlo] :: ([=c1, c2, -s0]).
[lo] :: ([=c1, +d, c2, -s0]).
[lo] :: ([=c1, =c2d, c2, -s0]).
[] :: ([=c1, +d, c2d]).
[čičmlo] :: ([=c1, c2, -s0]).
[kä’hcclo] :: ([=c1, c2, -s0]).
[å’hcclo] :: ([=c1, c2, -s0]).
[] :: ([=c1, c3]).
[] :: ([=c1, +d, c1]).
[] :: ([=c1, +b, c1]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c1, +f, c1]).
[] :: ([=c1, +a, c1]).
[] :: ([=c2, +e, c2]).
[] :: ([=c2, +e, +s0, c2, -e]).
[] :: ([=c1, +b, +a, +f, c1, -b]).
[] :: ([=c1, +a, +d, +f, c1, -a]).
[] :: ([=c1, +d, +f, c1, -d]).
[] :: ([=c1, +a, +f, c1, -a]).
