startCategory(cfin).
[] :: ([=c3, cfin]).
[ⵙⵉⵏ] :: ([c1, -b]).
[ⴽⵕⴰⴹ] :: ([c1, -b]).
[ⴽⴽⵓⵣ] :: ([c1, -b, -e]).
[ⵙⵎⵎⵓⵙ] :: ([c1, -b, -e]).
[ⵚⴹⵉⵚ] :: ([c1, -b, -e]).
[ⵙⴰ] :: ([c1, -b, -e]).
[ⵜⴰⵎ] :: ([c1, -c, -e]).
[ⵜⵥⴰ] :: ([c1, -c, -e]).
[ⵜⵉⵎⵉⴹⵉ] :: ([c3]).
[ⵜⵉⵎⵉⴹⵉ_ⴷ] :: ([=c3d, c3]).
[] :: ([=c2, +d, c3d]).
[ⵙⵏⴰⵜ_ⵜⵉⵎⴰⴹ] :: ([c3]).
[ⵙⵏⴰⵜ_ⵜⵉⵎⴰⴹ_ⴷ] :: ([=c3d, c3]).
[ⴽⵕⴰⵟⵜ_ⵜⵉⵎⴰⴹ] :: ([c3]).
[ⴽⵕⴰⵟⵜ_ⵜⵉⵎⴰⴹ_ⴷ] :: ([=c3d, c3]).
[ⵜ_ⵜⵉⵎⴰⴹ] :: ([=c1, +e, c3]).
[ⵜ_ⵜⵉⵎⴰⴹ_ⴷ] :: ([=c3d, =c3e, c3]).
[] :: ([=c1, +e, c3e]).
[] :: ([=c2, +s0, c3]).
[ⵎⵔⴰⵡ] :: ([c2, -s0, -d]).
[ⴷ_ⵎⵔⴰⵡ] :: ([=cnix, =c1, c2, -s0]).
[] :: ([cnix]).
[ⵉⴷ_ⵎⵔⴰⵡ] :: ([=c1, +b, c2, -s0]).
[ⵉⴷ_ⵎⵔⴰⵡ_ⵉ] :: ([=c1, =c2b, c2, -s0]).
[] :: ([=c1, +b, c2b]).
[ⵜ_ⵉⴷ_ⵎⵔⴰⵡ] :: ([=c1, +c, c2, -s0]).
[ⵜ_ⵉⴷ_ⵎⵔⴰⵡ_ⵉ] :: ([=c1, =c2c, c2, -s0]).
[] :: ([=c1, +c, c2c]).
[] :: ([=c1, c3]).
[ⵢⴰⵏ] :: ([c1]).
[] :: ([=c1, c2, -d]).
[] :: ([=c1, +c, c1]).
[] :: ([=c1, +e, c1]).
[] :: ([=c1, +b, c1]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c2, +d, c2]).
[] :: ([=c1, +b, +e, c1, -b]).
[] :: ([=c2, +s0, +d, c2, -s0]).
[] :: ([=c1, +c, +e, c1, -c]).
