startCategory(cfin).
[] :: ([=c3, cfin]).
[on] :: ([c2, -b, -s0]).
[yirmi] :: ([c2, -b, -s0]).
[otuz] :: ([c2, -b, -s0]).
[kırk] :: ([c2, -b, -s0]).
[elli] :: ([c2, -b, -s0]).
[altmış] :: ([c2, -b, -s0]).
[yetmiş] :: ([c2, -b, -s0]).
[seksen] :: ([c2, -b, -s0]).
[doksan] :: ([c2, -b, -s0]).
[] :: ([=c1, c2, -b]).
[bir] :: ([c1]).
[iki] :: ([c1, -c]).
[üç] :: ([c1, -c]).
[dört] :: ([c1, -c]).
[beş] :: ([c1, -c]).
[altı] :: ([c1, -c]).
[yedi] :: ([c1, -c]).
[sekiz] :: ([c1, -c]).
[dokuz] :: ([c1, -c]).
[yüz] :: ([c3]).
[yüz] :: ([=c3b, c3]).
[] :: ([=c2, +b, c3b]).
[yüz] :: ([=c1, +c, c3]).
[yüz] :: ([=c3b, =c3c, c3]).
[] :: ([=c1, +c, c3c]).
[] :: ([=c2, +s0, c3]).
[on] :: ([=c1, c2, -s0]).
[yirmi] :: ([=c1, c2, -s0]).
[otuz] :: ([=c1, c2, -s0]).
[kırk] :: ([=c1, c2, -s0]).
[elli] :: ([=c1, c2, -s0]).
[altmış] :: ([=c1, c2, -s0]).
[yetmiş] :: ([=c1, c2, -s0]).
[seksen] :: ([=c1, c2, -s0]).
[doksan] :: ([=c1, c2, -s0]).
[] :: ([=c1, c3]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c2, +b, c2]).
[] :: ([=c1, +c, c1]).
[] :: ([=c2, +b, +s0, c2, -b]).
