startCategory(cfin).
[одна] :: ([c1, -h]).
[двi] :: ([c1, -f, -i0]).
[три] :: ([c1, -c, -a, -g]).
[сiм] :: ([c1, -k, -j0, -a, -d]).
[] :: ([=c4, cfin]).
[чотири] :: ([c1, -g]).
[п'ять] :: ([c1]).
[шiсть] :: ([c1, -i0]).
[вiсiм] :: ([c1, -a, -d]).
[дев'ять] :: ([c1]).
[десять] :: ([c2, -j, -e, -s1]).
[двадцять] :: ([c2, -j, -e, -s1]).
[] :: ([=c1, +j0, c2, -j]).
[одинадцять] :: ([c2, -e, -s1]).
[дванадцять] :: ([c2, -e, -s1]).
[чотирнадцять] :: ([c2, -e, -s1]).
[п'ятнадцять] :: ([c2, -e, -s1]).
[шiстнадцять] :: ([c2, -e, -s1]).
[дев'ятнадцять] :: ([c2, -e, -s1]).
[сорок] :: ([c2, -e, -s1]).
[п'ятдесят] :: ([c2, -e, -s1]).
[шiстдесят] :: ([c2, -e, -s1]).
[дев'яносто] :: ([c2, -e, -s1]).
[] :: ([=c1, c2, -e]).
[ста] :: ([=c1, +g, c4]).
[ста] :: ([=c3e, =c4g, c4]).
[] :: ([=c1, +g, c4g]).
[] :: ([=c2, +e, c4e]).
[п'ятсот] :: ([c4]).
[п'ятсот] :: ([=c3e, c4]).
[шiстсот] :: ([c4]).
[шiстсот] :: ([=c3e, c4]).
[сот] :: ([=c1, +d, c4]).
[сот] :: ([=c3e, =c2d, c4]).
[] :: ([=c1, +d, c4d]).
[дев'ятсот] :: ([c4]).
[дев'ятсот] :: ([=c3e, c4]).
[тисяча] :: ([=c1, +h, c4]).
[тисяча] :: ([=c4i, =c4h, c4]).
[] :: ([=c1, +h, c4h]).
[] :: ([=c3, +i, c4i]).
[тисяч] :: ([=c2, +j, c4]).
[тисяч] :: ([=c4i, =c4k, c4]).
[] :: ([=c1, +k, c4k]).
[] :: ([=c3, +s0, c4]).
[сто] :: ([c3, -s0, -i]).
[сто] :: ([=c3e, c3, -s0]).
[] :: ([=c2, +e, c3e]).
[стi] :: ([=c1, +f, c3, -s0]).
[стi] :: ([=c3e, =c3f, c3, -s0]).
[] :: ([=c1, +f, c3f]).
[] :: ([=c2, +s1, c4]).
[надцять] :: ([=c1, +a, c2, -s1]).
[двадцять] :: ([=c1, c2, -s1]).
[дцять] :: ([=c1, +c, c2, -s1]).
[дцять] :: ([=c1, =c2c, c2, -s1]).
[] :: ([=c1, +c, c2c]).
[сорок] :: ([=c1, c2, -s1]).
[п'ятдесят] :: ([=c1, c2, -s1]).
[шiстдесят] :: ([=c1, c2, -s1]).
[десят] :: ([=c1, +d, c2, -s1]).
[десят] :: ([=c1, =c2d, c2, -s1]).
[] :: ([=c1, +d, c2d]).
[дев'яносто] :: ([=c1, c2, -s1]).
[] :: ([=c1, c4]).
[] :: ([=c1, +i0, c3, -i]).
[] :: ([=c1, +i0, c1]).
[] :: ([=c1, +d, c1]).
[] :: ([=c1, +c, c1]).
[] :: ([=c2, +j, c2]).
[] :: ([=c3, +i, c3]).
[] :: ([=c1, +k, c1]).
[] :: ([=c1, +g, c1]).
[] :: ([=c1, +f, c1]).
[] :: ([=c1, +j0, c1]).
[] :: ([=c1, +h, c1]).
[] :: ([=c1, +a, c1]).
[] :: ([=c2, +s1, c2]).
[] :: ([=c3, +s0, c3]).
[] :: ([=c2, +e, c2]).
[] :: ([=c1, +f, +i0, c1, -f]).
[] :: ([=c2, +j, +e, +s1, c2, -j]).
[] :: ([=c1, +k, +j0, +a, +d, c1, -k]).
[] :: ([=c3, +s0, +i, c3, -s0]).
[] :: ([=c1, +j0, +a, +d, c1, -j0]).
[] :: ([=c1, +a, +g, c1, -a]).
[] :: ([=c2, +e, +s1, c2, -e]).
[] :: ([=c1, +a, +d, c1, -a]).
[] :: ([=c1, +c, +a, +g, c1, -c]).
