startCategory(cfin).
[один] :: ([c1, -a]).
[] :: ([=c3, cfin]).
[два] :: ([c1, -b, -c]).
[три] :: ([c1, -b, -c, -g]).
[сім] :: ([c1, -b, -e]).
[вісім] :: ([c1, -b, -e]).
[сто] :: ([c3]).
[сто] :: ([=c3f, c3]).
[] :: ([=c2, +f, c3f]).
[двісті] :: ([c3]).
[двісті] :: ([=c3f, c3]).
[ста] :: ([=c1, +g, c3]).
[ста] :: ([=c3f, =c3g, c3]).
[] :: ([=c1, +g, c3g]).
[п’ятсот] :: ([c3]).
[п’ятсот] :: ([=c3f, c3]).
[шістсот] :: ([c3]).
[шістсот] :: ([=c3f, c3]).
[сот] :: ([=c1, +e, c3]).
[сот] :: ([=c3f, =c2e, c3]).
[] :: ([=c1, +e, c3e]).
[дев’ятсот] :: ([c3]).
[дев’ятсот] :: ([=c3f, c3]).
[] :: ([=c2, +s0, c3]).
[десять] :: ([c2, -s0, -f]).
[адцять] :: ([=c1, +a, c2, -s0]).
[надцять] :: ([=c1, +b, c2, -s0]).
[чотирнадцять] :: ([c2, -s0, -f]).
[п’ятнадцять] :: ([c2, -s0, -f]).
[шістнадцять] :: ([c2, -s0, -f]).
[дев’ятнадцять] :: ([c2, -s0, -f]).
[дцять] :: ([=c1, +c, c2, -s0]).
[дцять] :: ([=c1, =c2c, c2, -s0]).
[] :: ([=c1, +c, c2c]).
[сорок] :: ([c2, -s0, -f]).
[сорок] :: ([=c1, c2, -s0]).
[п’ятдесят] :: ([c2, -s0, -f]).
[п’ятдесят] :: ([=c1, c2, -s0]).
[шістдесят] :: ([c2, -s0, -f]).
[шістдесят] :: ([=c1, c2, -s0]).
[десят] :: ([=c1, +e, c2, -s0]).
[десят] :: ([=c1, =c2e, c2, -s0]).
[] :: ([=c1, +e, c2e]).
[дев’яносто] :: ([c2, -s0, -f]).
[дев’яносто] :: ([=c1, c2, -s0]).
[] :: ([=c1, c3]).
[чотири] :: ([c1, -g]).
[п’ять] :: ([c1]).
[шість] :: ([c1]).
[дев’ять] :: ([c1]).
[] :: ([=c1, c2, -f]).
[] :: ([=c2, +f, c2]).
[] :: ([=c1, +c, c1]).
[] :: ([=c1, +e, c1]).
[] :: ([=c1, +b, c1]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c1, +g, c1]).
[] :: ([=c1, +a, c1]).
[] :: ([=c1, +b, +e, c1, -b]).
[] :: ([=c1, +b, +c, +g, c1, -b]).
[] :: ([=c2, +s0, +f, c2, -s0]).
[] :: ([=c1, +b, +c, c1, -b]).
[] :: ([=c1, +c, +g, c1, -c]).
