startCategory(cfin).
[dwaj] :: ([c1, -f, -i]).
[tři] :: ([c1, -c, -a, -h]).
[sto] :: ([c2, -g, -s0]).
[] :: ([=c3, cfin]).
[jedyn] :: ([c1]).
[štyri] :: ([c1, -h]).
[pjeć] :: ([c1, -i, -k]).
[šěsć] :: ([c1, -d, -i, -k]).
[sydom] :: ([c1, -a, -d, -i, -k]).
[wósom] :: ([c1, -i]).
[dźewjeć] :: ([c1, -d, -i, -k]).
[dźesać] :: ([c2, -j, -e, -s0]).
[jědnaće] :: ([c2, -j, -e, -s0]).
[dwanaće] :: ([c2, -j, -e, -s0]).
[štyrnaće] :: ([c2, -j, -e, -s0]).
[pjatnaće] :: ([c2, -j, -e, -s0]).
[šěsnaće] :: ([c2, -j, -e, -s0]).
[wosomnaće] :: ([c2, -j, -e, -s0]).
[dźewjatnaće] :: ([c2, -j, -e, -s0]).
[dwaceći] :: ([c2, -j, -e, -s0]).
[štyrceći] :: ([c2, -j, -e, -s0]).
[wosomdźesat] :: ([c2, -j, -e, -s0]).
[] :: ([=c1, c2, -j]).
[połsta] :: ([c2, -e, -s0]).
[] :: ([=c1, c2, -e]).
[sto_a] :: ([=c3e, c3]).
[] :: ([=c2, +e, c3e]).
[dwě_sćě] :: ([c3]).
[] :: ([=c31s, =c3f, c3]).
[] :: ([=c1, +f, c3f]).
[a_dwaceći] :: ([=c2, +g, c31s]).
[] :: ([=c32s, =c3f, c3]).
[a_štyrceći] :: ([=c2, +g, c32s]).
[sta] :: ([=c1, +h, c3]).
[sta_a] :: ([=c3e, =c3h, c3]).
[] :: ([=c1, +h, c3h]).
[sto_a] :: ([=c3j, =c3i, c3]).
[] :: ([=c1, +i, c3i]).
[] :: ([=c2, +j, c3j]).
[] :: ([=c33s, =c3i, c3]).
[a_połsta] :: ([=c2, +g, c33s]).
[stow] :: ([=c1, +k, c3]).
[wosom] :: ([=c34s, c3]).
[w] :: ([=c2, +g, c34s]).
[] :: ([=c2, +s0, c3]).
[naće] :: ([=c1, +a, c2, -s0]).
[adwaceći] :: ([=cnix, =c1, c2, -s0]).
[] :: ([cnix]).
[ceći] :: ([=c1, +c, c2, -s0]).
[a] :: ([=c21s, =c1, c2, -s0]).
[ceći] :: ([=c1, +c, c21s]).
[aštyrceći] :: ([=cnix, =c1, c2, -s0]).
[apołsta] :: ([=cnix, =c1, c2, -s0]).
[dźesat] :: ([=c1, +d, c2, -s0]).
[a] :: ([=c22s, =c1, c2, -s0]).
[dźesat] :: ([=c1, +d, c22s]).
[awosomdźesat] :: ([=cnix, =c1, c2, -s0]).
[] :: ([=c1, c3]).
[] :: ([=c1, +i, c1]).
[] :: ([=c1, +d, c1]).
[] :: ([=c1, +c, c1]).
[] :: ([=c2, +g, c2]).
[] :: ([=c2, +j, c2]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c1, +k, c1]).
[] :: ([=c1, +f, c1]).
[] :: ([=c1, +h, c1]).
[] :: ([=c1, +a, c1]).
[] :: ([=c2, +e, c2]).
[] :: ([=c1, +a, +d, +i, +k, c1, -a]).
[] :: ([=c2, +e, +s0, c2, -e]).
[] :: ([=c1, +d, +i, +k, c1, -d]).
[] :: ([=c1, +c, +a, +h, c1, -c]).
[] :: ([=c1, +i, +k, c1, -i]).
[] :: ([=c1, +f, +i, c1, -f]).
[] :: ([=c2, +j, +e, +s0, c2, -j]).
[] :: ([=c2, +g, +s0, c2, -g]).
[] :: ([=c1, +a, +h, c1, -a]).
