startCategory(cfin).
[kahs] :: ([c1, -e, -a]).
[] :: ([=c3, cfin]).
[ühs] :: ([c1, -a]).
[ke̮m] :: ([c1, -c, -a]).
[nellä] :: ([c1, -c, -a]).
[vīsi] :: ([c1]).
[kūsi] :: ([c1]).
[seitsē] :: ([c1, -c, -a]).
[kahe̮sā] :: ([c1, -c, -a]).
[ühesǟ] :: ([c1, -c, -a]).
[sata] :: ([c3]).
[sata] :: ([=c3d, c3]).
[] :: ([=c2, +d, c3d]).
[atā] :: ([=c1, +e, c3]).
[atā] :: ([=c3d, =c3e, c3]).
[] :: ([=c1, +e, c3e]).
[satā] :: ([=c1, +c, c3]).
[satā] :: ([=c3d, =c2c, c3]).
[] :: ([=c1, +c, c3c]).
[vīssatā] :: ([c3]).
[vīssatā] :: ([=c3d, c3]).
[kūssatā] :: ([c3]).
[kūssatā] :: ([=c3d, c3]).
[] :: ([=c2, +s0, c3]).
[tšümmē] :: ([c2, -s0, -d]).
[te̮·šše̮me̮tta] :: ([=c1, +a, c2, -s0]).
[vīste̮·šše̮me̮tta] :: ([c2, -s0, -d]).
[kūste̮·šše̮me̮tta] :: ([c2, -s0, -d]).
[kahš́tš́ümmettä] :: ([c2, -s0, -d]).
[kahš́tš́ümmettä] :: ([=c1, c2, -s0]).
[tšümmettä] :: ([=c1, +c, c2, -s0]).
[tšümmettä] :: ([=c1, =c2c, c2, -s0]).
[] :: ([=c1, +c, c2c]).
[vīš́tš́ümmettä] :: ([c2, -s0, -d]).
[vīš́tš́ümmettä] :: ([=c1, c2, -s0]).
[kūš́tš́ümmettä] :: ([c2, -s0, -d]).
[kūš́tš́ümmettä] :: ([=c1, c2, -s0]).
[] :: ([=c1, c3]).
[] :: ([=c1, c2, -d]).
[] :: ([=c1, +c, c1]).
[] :: ([=c1, +e, c1]).
[] :: ([=c2, +s0, c2]).
[] :: ([=c1, +a, c1]).
[] :: ([=c2, +d, c2]).
[] :: ([=c2, +s0, +d, c2, -s0]).
[] :: ([=c1, +c, +a, c1, -c]).
[] :: ([=c1, +e, +a, c1, -e]).
